{
  "Summer 2022": {
    "2022-06-21": {
      "name": "Jeremy Tyson",
      "title": "Quasiconformal distortion of Assouad-type dimensions",
      "abstract": "Quasiconformal mappings are homeomorphisms with a uniform bound on the relative distortion of distance. They arise in diverse contexts in analysis and geometry, including dynamics, Kleinian groups, differential geometry, and analysis on fractals and in metric spaces. The distortion of dimension by quasiconformal maps (and maps in other regularity classes) is a classical subject going back to work of Gehring and V&auml;is&auml;l&auml; in the 1970s. I will discuss recent results on the quasiconformal distortion of Assouad dimension and the Assouad spectrum, with applications to the classification of planar polynomial spirals. An attractive feature of the latter classification is that it is sharp up to the level of the quasiconformal distortion. This talk is based on joint work with Efstathios Chrontsios Garitsis.",
      "video": ""
    },
    "2022-08-09": {
      "name": "Joris Roos",
      "title": "Spherical maximal functions and fractal dimensions of dilation sets",
      "abstract": "In this talk we will consider spherical maximal operators in two and higher dimensions with a supremum taken over a given dilation set. It turns out that the sharp <i>L<sup>p</sup></i> improving properties of such operators are closely related to fractal dimensions of the dilation set such as the Minkowski and Assouad dimensions. At the center of the talk will be a simple characterization of the closed convex sets which can occur as closure of the sharp <i>L<sup>p</sup></i> improving region of such a maximal operator. This is joint work with Andreas Seeger. Time permitting, we will also discuss some ongoing work and further directions.",
      "video": ""
    }
  },
  "Spring 2022": {
    "2022-01-25": {
      "name": "Kenneth Falconer",
      "title": "Dimensions of images under stochastic processes",
      "abstract": "We will review results concerning the dimensions (Hausdorff, box, etc.) of the images of sets and measures under processes such as Brownian or fractional Brownian motion. We will then discuss ongoing work involving a different type of process.",
      "video": ""
    },
    "2022-02-01": {
      "name": "Collin Bleak",
      "title": "3/2's generation and spread for R. Thompson's group T.",
      "abstract": "A group <i>G</i> is said to be 3/2's-generated if for any 1 &ne; <i>g</i> &isin; <i>G</i>, there is <i>h</i> &isin; <i>G</i> so that <<i>h</i>,<i>g</i>> = <i>G</i>.  Further, <i>G</i> is uniformly 3/2's-generated if <i>h</i> can always be chosen from some fixed conjugacy class {<i>c<sup>x</sup></i> | <i>x</i> &isin; <i>G</i>} of elements.   Being 3/2's-generated is a theme for (all but finitely many) finite simple groups, and it is natural to consider whether all infinite finitely presented groups are 3/2's-generated.  It is known that R. Thompson's group <i>V</i> is 3/2's-generated, but known arguments do not extend to similar arguments for <i>V</i>'s finitely presented simple subgroup <i>T</i>.  In this talk, we use the action of <i>T</i> on the circle to show that <i>T</i> is uniformly 3/2's generated.  We also briefly discuss what is known about a related concept: the spread of <i>T</i>.  Joint with Casey Donoven, Scott Harper, James Hyde, and Rachel Skipper.",
      "video": ""
    },
    "2022-02-08": {
      "name": "Alex Rutar",
      "title": "Attainable forms of intermediate dimensions",
      "abstract": "The intermediate dimensions of a set are a family of dimensions, indexed on [0,1], which lie between the Hausdorff and box dimensions of the set. A recent result (joint with Amlan Banaji) shows that a function can be the intermediate dimensions of some set in &Ropf;<sup><i>d</i></sup> if and only if the function satisfies certain local derivative constraints. In this talk, I will provide some intuition behind this result. Then, if time permits, I will describe the construction of sets with prescribed intermediate dimensions.",
      "video": ""
    },
    "2022-02-15": {
      "name": "Jonathan Fraser",
      "title": "Fourier dimensions and Kakeya type problems",
      "abstract": "A Kakeya set is a (compact) set in &Ropf;<sup><i>d</i></sup> containing a unit line segment in all possible directions.  The famous Kakeya conjecture (open for <i>d</i>>2) is that Kakeya sets must have Hausdorff dimension <i>d</i>.  I will discuss recent joint work with Harris and Kroon related to this problem.",
      "video": ""
    },
    "2022-03-01": {
      "name": "Lars Olsen",
      "title": "The Baire Hierarchy, multifractal decomposition sets and Π<sub>γ</sub><sup>0</sup>-completeness",
      "abstract": "This talk will discuss the position of the so-called \"multifractal decomposition sets\" in the Baire Hierarchy. In particular, we will prove that \"multifractal decomposition sets\" are the building blocks from which all other &Pi;<sub>&gamma;</sub><sup>0</sup>-sets can be constructed; more, precisely, \"multifractal decomposition sets\" are &Pi;<sub>&gamma;</sub><sup>0</sup>-complete.\n\nAs an application we find the position of the classical Eggleston-Besicovitch set in the Baire Hierarchy.",
      "video": ""
    },
    "2022-03-15": {
      "name": "Raquel Couto",
      "title": "Piling processes for some 2-dimensional expanding systems",
      "abstract": "Recent work of Freitas, Freitas and Todd (2020) establishes the existence of enriched functional limit theorems for dynamical systems, in particular, the existence of functional limit theorems for dynamical sums of heavy tailed random variables in an enriched space where clustering patterns are not lost. Clustering phenomena arise naturally in the dynamical context due to the recurrence properties of the underlying systems. The crucial device that allows for keeping record of the clustering structure is called the piling process and was introduced in the aforementioned work. The main aim of this talk is to exhibit the piling processes for some concrete examples where the dynamics is (2<i>x</i> mod 1, 3<i>y</i> mod 1). If time permits, we will comment on how the functional limit theorems can then be derived and present their explicit form for the previously worked out examples. This is based on ongoing PhD work under the supervision of Mike Todd.",
      "video": ""
    },
    "2022-03-22": {
      "name": "Jerome Rousseau",
      "title": "Shortest distance between random orbits and correlation dimension",
      "abstract": "We study the shortest distance between two orbit segments of length <i>n</i> for rapidly mixing dynamical systems. We will show that the asymptotic behavior is given by a dimension-like quantity associated to the invariant measure, called its correlation dimension (or R&eacute;nyi entropy). \nFor the shift map, we will show that this problem corresponds to a well-known sequences matching problem: the longest common substring problem.\nWe will also extend this study to the realm of random dynamical systems and explain the difference between the annealed and quenched version of this problem and how a non-smooth behavior of the associated asymptotic exponent may arise.\nThis includes some joint works with Vanessa Barros, Adriana Coutinho, Sebastien Gouezel, Rodrigo Lambert, Lingmin Liao and Manuel Stadlbauer.",
      "video": ""
    },
    "2022-04-19": {
      "name": "Boyuan Zhao",
      "title": "Shortest distance between and within orbits",
      "abstract": "Given a dynamical system on a compact metric space, one can investigate the asymptotic behaviour of the shortest distance between the first n iterates of any pair of distinct points (<i>x</i>,<i>y</i>) in the space; under the assumptions of fast decay of correlations and uniform upper bound for ball sizes, Rousseau, Barros and Liao (2019) gave a quantitative result using correlation dimension inspired by Renyi entropy. Similar techniques may also be applied to analyse the behaviour of the shortest distance within the orbit of a single point in the phase space, while taking into account the measure of points with rapid returns via Renyi entropy function.",
      "video": ""
    },
    "2022-04-26": {
      "name": "István Kolossváry",
      "title": "The Assouad dimension of self-affine measures on sponges",
      "abstract": "A class of self-affine sponges generated by diagonal matrices is introduced which generalise well-known planar constructions to higher dimensions. We derive upper and lower bounds for the Assouad and lower dimensions of self-affine measures supported on these sponges. The upper and lower bounds always coincide in dimensions <i>d</i>=2,3 yielding precise explicit formulae for the dimensions. Moreover, there are easy to check conditions guaranteeing that the bounds coincide for <i>d</i> &ge; 4. An interesting consequence of our results is that there can be a 'dimension gap' for such self-affine constructions, even in the plane. Joint work with J. M. Fraser.",
      "video": ""
    },
    "2022-05-03": {
      "name": "Amlan Banaji",
      "title": "Assouad spectrum of infinitely generated self-conformal sets",
      "abstract": "If an iterated function system consists of a countably infinite number of contractions then the Hausdorff, box and Assouad dimensions of the limit set can all differ, even if the contractions are assumed to be conformal and well-separated. We will explain what is known about the dimension theory of these limit sets, paying particular attention to the Assouad spectrum, which is a family of dimensions lying between box and Assouad dimension. We present bounds for the Assouad spectrum which are sharp in general. The Assouad spectrum of the class of examples which we use to show that these bounds are sharp can display interesting behaviour, such as having two phase transitions. This is based on joint work with Jonathan Fraser.",
      "video": ""
    }
  },
  "Autumn 2021": {
    "2021-09-21": {
      "name": "Sascha Troscheit",
      "title": "Studying random metric spaces with dimension theory",
      "abstract": "In this talk I will give an overview of how random sets that exhibit some form of stochastic self-similarity can be studied with methods from dimension theory. In particular, I will elaborate on the family of Assouad-type dimensions which have attracted a lot of recent attention in fractal geometry. Their usefulness stems from their link to embedding theory and the Assouad dimension(s) can be used to answer embedding problems in random geometry. The behaviour of the Assouad spectrum exhibits \"geometric phase transitions\" and can be used to quantify such phase changes in random (or deterministic) sets. I will give a survey of recent results and talk about the embeddability of the Brownian continuum random tree and the Brownian map using quasi-symmetric mappings.",
      "video": "https://www.youtube.com/watch?v=H2wIUSsB8gE"
    },
    "2021-09-28": {
      "name": "Jonathan Fraser",
      "title": "Dimensions of Kleinian orbital sets",
      "abstract": "Given a fixed subset of hyperbolic space and a Kleinian group acting on that space, the orbital set is the orbit of the given set under the group.  When the given set is compact, I will compute the upper box dimensions of the orbital set in terms of the dimensions of the given set and of the limit set of the Kleinian group.  There is a connection here with the dimension theory of inhomogeneous self-similar sets, for example.  When the given set is not compact, I will construct examples to show that different things can happen.  This is joint work with Tom Bartlett.",
      "video": "https://www.youtube.com/watch?v=zZYZoD9yFB4"
    },
    "2021-10-05": {
      "name": "Mike Todd",
      "title": "Point processes in extreme dynamics",
      "abstract": "I'll explain how point processes can be used to understand extreme values in a dynamical system.  These processes can zoom in on the parts of a dynamical orbit where 'extreme events' occur and asymptotically converge as we look deeper into the orbit: if the system is 'mixing enough' they converge to a form of Poisson process.  They can capture structure in the extreme events and tell us, for example, about record times and record values for our system.",
      "video": "https://www.youtube.com/watch?v=_9KO37nehbo"
    },
    "2021-10-12": {
      "name": "Amlan Banaji",
      "title": "Intermediate dimensions of Bedford-McMullen carpets",
      "abstract": "In this talk we will present a precise formula for the &theta;-intermediate dimensions of all Bedford-McMullen carpets for the whole spectrum of &theta;. We will explain with the aid of some pictures that the graph of the intermediate dimensions has an interesting form not seen in previous examples. We describe an unexpected connection to multifractal analysis, and as an application of our results, we give a necessary condition for two Bedford-McMullen carpets with non-uniform vertical fibres to be bi-Lipschitz equivalent. This is joint work with Istvan Kolossvary.",
      "video": "https://www.youtube.com/watch?v=hoHdg71ycqs"
    },
    "2021-10-19": {
      "name": "Han Yu",
      "title": "Non-Salem sets in metric Diophantine approximation",
      "abstract": "Kaufman proved that sets of well-approximable numbers on the real line are Salem. A natural question to ask is whether or not the same thing holds in higher dimensions as well. That is, whether or not this Kaufman's result is just a special case (in &#8477;) of a general phenomenon (in &#8477;<sup><i>n</i></sup>). In this talk, I present a recent result which tells us that Kaufman's result is in fact very special. In higher dimensions, sets of well approximable vectors (suitably defined) are in general not Salem. This is joint work with Kyle Hambrook (San Jose State University).",
      "video": ""
    },
    "2021-10-26": {
      "name": "István Kolossváry",
      "title": "On the convergence rate of the chaos game",
      "abstract": "In the 1988 textbook \"Fractals Everywhere\", M. Barnsley introduced an iterative random procedure for generating fractals which is coined the \"Chaos Game\". Two natural questions are: what is the expected time taken by this procedure to become <i>r</i>-dense in the fractal, and for which measure can this expected time be minimised? In this talk we will discuss how the box dimension of the measure comes into play and characterise the family of probability vectors that minimise the expected time in the case of Bernoulli measures defined on Bedford-McMullen carpets. Based on joint work with Bal&#225;zs B&#225;r&#225;ny and Natalia Jurga.",
      "video": ""
    },
    "2021-11-02": {
      "name": "Lars Olsen",
      "title": "Multifractal tube formulas",
      "abstract": "Tube formulas give the volume of the set of all points within the distance <i>r</i> of a (compact) subset of Euclidean space for <i>r</i> > 0, and play an instrumental role in the study of geometric measure theory (e.g. the box dimension can be defined in this way). Recently, very precise tube formulas for self-similar sets satisfying the Open Set Condition (OSC) have attracted considerable interest. In this talk we will study multifractal tube formulas of self-similar sets and self-similar measures satisfying the OSC.",
      "video": ""
    },
    "2021-11-09": {
      "name": "Mark Holland",
      "title": "Dichotomy results for eventually always hitting time statistics and almost sure growth of extremes",
      "abstract": "Suppose (<i>f</i>, <i>X</i>, &mu;) is a measure preserving dynamical system and &phi; : <i>X</i> &rarr; &reals; a measurable function. Consider the maximum process <i>M<sub>n</sub></i> :=max{<i>X<sub>1</sub></i>,...,<i>X<sub>n</sub></i>}, where <i>X<sub>i</sub></i> = &phi;\t&#9675; <i>f</i><sup><i>i</i>-1</sup> is a time series of observations on the system.  Suppose that (<i>u<sub>n</sub></i>) is a non-decreasing sequence of real numbers, such that &mu;(<i>X<sub>1</sub></i> > <i>u<sub>n</sub></i>) &rarr; 0. For certain dynamical systems, we obtain a zero--one measure dichotomy for &mu;(<i>M<sub>n</sub></i> &le; <i>u<sub>n</sub></i>, i.o.) depending on the sequence <i>u<sub>n</sub></i>. Specific examples are piecewise expanding interval maps including the Gauss map. For the broader class of non-uniformly hyperbolic dynamical systems, we make significant improvements on existing literature for characterising the sequences <i>u<sub>n</sub></i>. Our results on the permitted sequences <i>u<sub>n</sub></i> are commensurate with the optimal sequences (and series criteria) obtained by Klass(1985) for i.i.d. processes. Moreover, we also develop new series criteria on the permitted sequences in the case where the i.i.d. theory breaks down. Our analysis has strong connections to specific problems in eventual always hitting time statistics and extreme value theory. This work is joint with M. Kirsebom, P. Kunde and T. Persson.",
      "video": ""
    },
    "2021-11-16": {
      "name": "Liam Stuart",
      "title": "Refined horoball counting for Kleinian group actions",
      "abstract": "The topic of this talk revolves around the following question: given a Kleinian group &Gamma; and <i>r</i>>0, how many horoballs (Euclidean balls tangent to the boundary of hyperbolic space at parabolic points) of radius &#8776; <i>r</i> should be expect to see? We will discuss a result of Stratmann and Velani which gives global information regarding this question and then provide some localisations of this result where we restrict our attention to small balls in the limit set. We will also discuss some applications of our results to Diophantine approximation and the dimension theory of conformal measures supported on the limit set. Joint work with Jonathan Fraser.",
      "video": ""
    },
    "2021-11-23": {
      "name": "Natalia Jurga",
      "title": "Cover times for dynamical systems",
      "abstract": "Given a dynamical system <i>f</i> : <i>I</i> &#8614; <i>I</i> we study the asymptotic expected behaviour of the cover time: the rate at which orbits become dense in the state space <i>I</i>. We will see how this can be studied through the lens of dynamical systems with holes and the spectral theory of the transfer operators associated to these systems. This is joint work with Mike Todd.",
      "video": ""
    }
  },
  "Spring 2021": {
    "2021-02-02": {
      "name": "Collin Bleak",
      "title": "Context Sensitive Markov Chains with an application towards genetics",
      "abstract": "The role of subgraphs of de Bruijn graphs in genetics has been establish for some time now.  In this talk, we will explore a new technique for modifying de Bruijn graphs to enable finer control in setting up context sensitive Markov Models, and we explain briefly a first impact in genetic modelling.  Joint with Andy Lynch and Anja Minsaas.",
      "video": ""
    },
    "2021-02-09": {
      "name": "István Kolossváry",
      "title": "Calculating box dimension with the method of types",
      "abstract": "This talk will present an argument based on using the method of types to calculate the box dimension of sets. Demonstrating first on self-similar sets,  we then use it to generalize the formula for the box dimension of self-affine carpets of Gatzouras-Lalley and of Bara&#324;ski type to their higher dimensional sponge analogues. In addition to a closed form, we also obtain a variational formula which resembles the Ledrappier-Young formula for Hausdorff dimension.",
      "video": "https://www.youtube.com/watch?v=uIA9uwpfxKg"
    },
    "2021-02-16": {
      "name": "Mike Todd",
      "title": "Pressure on non-compact spaces",
      "abstract": "Thermodynamic formalism has at lot to say in the context of sufficiently regular dynamical systems in compact spaces, for example about the existence and uniqueness properties of equilibrium states, and their characterisation as some derivative of the pressure function.  This talk considers non-compact settings, particularly the case of countable Markov shifts.  A first natural approach is to take the completion of the space and hope that the boundary created doesn't interfere with too many thermodynamic properties.  I'll look at how one might do this, some drawbacks, and how they can, in some cases, be overcome.",
      "video": "https://www.youtube.com/watch?v=E-hbWtY8Rc8"
    },
    "2021-02-23": {
      "name": "Richárd Balka",
      "title": "The range of dimensions of microsets",
      "abstract": "We say that <i>E</i> is a microset of the compact set <i>K</i> &#8834; &#8477;<sup><i>d</i></sup> if there exist sequences &#955;<sub><i>n</i></sub> &#8805; 1 and <i>u<sub>n</sub></i> &#8712; &#8477;<sup><i>d</i></sup> such that \n(&#955;<sub><i>n</i></sub><i>K</i> + <i>u<sub>n</sub></i>) &#8745; [0,1]<sup><i>d</i></sup> converges to <i>E</i> in the Hausdorff metric, and moreover, <i>E</i> &#8745; (0,1)<sup><i>d</i></sup> &#8800; &#8709;.\nThe main result of the talk is to prove that for a non-empty set <i>A</i> &#8834; [0,<i>d</i>] there is a compact set <i>K</i> &#8834; &#8477;<sup><i>d</i></sup> such that the set of Hausdorff dimensions attained by the microsets of <i>K</i> \nequals <i>A</i> if and only if <i>A</i> is analytic and contains its infimum and supremum. This answers a question of Fraser, Howroyd, K&#228;enm&#228;ki, and Yu. This is joint work with M&#225;rton Elekes and Viktor Kiss.",
      "video": "https://www.youtube.com/watch?v=67flMI0FJYQ"
    },
    "2021-03-02": {
      "name": "Chris Bishop",
      "title": "Random thoughts on random sets",
      "abstract": "I will discuss some open problems that I have thought about over the last 30 years. Some are well known (e.g., growth rate of DLA), but a few may be novel, such as the flow associated to a planar triangulation. There will be many pictures, results of some computer experiments, but very few theorems or proofs.  This is essentially three mini-lectures on independent topics strung together.",
      "video": "https://www.youtube.com/watch?v=JlB9weFqSlo"
    },
    "2021-03-09": {
      "name": "Jim Belk",
      "title": "Quasisymmetries of finitely ramified Julia sets",
      "abstract": "Quasisymmetries are an important class of homeomorphisms between metric spaces related to quasiconformal geometry.  In this talk, I will explain how certain finitely ramified fractals support a natural family of quasisymmetrically equivalent metrics with respect to which any homeomorphism that locally preserves the cellular structure is a quasisymmetry, and I will discuss applications of these results to the quasisymmetry groups of finitely ramified Julia sets.  This is joint work with Bradley Forrest.",
      "video": "https://www.youtube.com/watch?v=g0jRjOacqZo"
    },
    "2021-03-16": {
      "name": "Raquel Couto",
      "title": "Clustering patterns of rare events",
      "abstract": "We are interested in rare events for dynamical systems, i.e. orbit visits to small sets of the phase space. In 2010, Freitas, Freitas and Todd linked the study of recurrence properties of a dynamical system to Extreme Value Theory and Point Process theory. In the presence of clustering of extreme events, the problem becomes more interesting and received attention over the subsequent years. In this talk, after a fast-forwarded overview of the theory, we focus on the piling process introduced in the most recent work of Freitas, Freitas and Todd, via some worked out examples. In particular, the existence of such well-defined structure is a requirement for the Enriched Functional Limit Theorems derived in the same paper, however the piling process may on its own provide a new insight to clustering patterns.",
      "video": "https://www.youtube.com/watch?v=bpUesUzJzsw"
    },
    "2021-04-06": {
      "name": "Kenneth Falconer",
      "title": "Strong Marstrand theorems, duality and line sets",
      "abstract": "We will review a version of Marstrand's projection theorem, which is often overlooked. We will introduce the notion of duality between points and lines with projections of points corresponding to intersections of lines, and thus obtain results on dimensions of intersections with sets of lines.",
      "video": "https://www.youtube.com/watch?v=gVRiN4WuSHs"
    },
    "2021-04-13": {
      "name": "Jian-Ci Xiao",
      "title": "Connected components of fractal squares",
      "abstract": "We will be mainly interested in connected components of a specific class of planar self-similar sets called fractal squares. I will first introduce several existing criteria on connected and totally disconnected fractal squares, and then talk about how to characterize fractal squares with finitely many connected components. Some methods can also be applied to carpet-like self-affine sets such as Bedford-McMullen carpets.",
      "video": "https://www.youtube.com/watch?v=PEL70mS0Ric"
    },
    "2021-04-20": {
      "name": "Amlan Banaji",
      "title": "Dimensions of infinitely generated attractors",
      "abstract": "If an iterated function systems (IFS) has a countably infinite number of contractions, the Hausdorff and box dimensions of the limit set can differ, even when the contractions are conformal maps. The intermediate dimensions are a family of dimensions which lie between the Hausdorff and box dimensions, and we will discuss some results on the Hausdorff, box and intermediate dimensions of limit sets of infinite iterated function systems. We will show that much better information can be obtained if the contractions are conformal, and we consider applications to sets of irrational numbers whose continued fraction expansions have restricted digits. We will explain that for 'generic' infinite IFSs the box dimension of the limit set (unlike the Hausdorff dimension) equals the ambient spatial dimension. Based on joint work with Jonathan Fraser.",
      "video": "https://www.youtube.com/watch?v=KL6q4UNnVEk"
    },
    "2021-04-27": {
      "name": "Jeremy Tyson",
      "title": "Distortion of dimension by Sobolev and quasiconformal maps",
      "abstract": "I will survey the theory of distortion of dimension by mappings with prescribed regularity. The main focus will be on distortion of Hausdorff dimension, although other notions (e.g. box-counting dimension and Assouad dimension) will also show up. We primarily consider maps in the first-order Sobolev class <i>W</i><sup>1,<i>p</i></sup> and quasiconformal maps. Classical results in this area date back to the work of Gehring and V&#228;is&#228;l&#228; in the 1970s, and concern the effect of a fixed quasiconformal mapping on the dimension of a fixed set. I will also discuss more recent work on the distortion of dimension by a fixed mapping on generic elements in parameterized families of sets. To keep things simple, we will restrict attention to finite-dimensional Euclidean spaces, however, many of the results which I will discuss have extensions to, or interesting modifications in non-Riemannian manifolds and more general metric spaces.",
      "video": "https://www.youtube.com/watch?v=pm63iahzipw"
    }
  },
  "Autumn 2020": {
    "2020-09-22": {
      "name": "Jonathan Fraser",
      "title": "A nonlinear projection theorem for Assouad dimension and the distance set problem",
      "abstract": "The dimension theory of orthogonal projections of fractal sets is fairly well-known and well-understood.  It is equally natural to consider families of nonlinear projections (e.g. radial projections) and similar phenomena are known to hold provided the family has enough 'transversality'.  I will discuss a recent nonlinear projection theorem for Assouad dimension and then use this to completely resolve the Assouad dimension analogue of the distance set problem for sets in the plane.",
      "video": "https://www.youtube.com/watch?v=I7M5VZLQvzI"
    },
    "2020-09-29": {
      "name": "Mike Todd",
      "title": "Clustering of extreme events",
      "abstract": "For a sequence of real-valued random variables <i>X</i><sub>1</sub>, ..., <i>X<sub>n</sub></i> we think of an extreme event as some <i>X<sub>i</sub></i> exceeding some threshold.  Choosing thresholds carefully w.r.t. <i>n</i>, and rescaling time, one can often derive interesting limits which can be represented as Poisson Point Processes or L&#233;vy processes.  However, if exceedances come in clusters, as many natural extreme events do, then the usual machinery can break down.  Here I'll explain how this theory can be applied to dynamical systems and how to extend the theory to deal with clustering.  This is joint work with Ana Cristina Freitas and Jorge Freitas (Porto).",
      "video": "https://www.youtube.com/watch?v=qEY57pbTjN8"
    },
    "2020-10-06": {
      "name": "Liam Stuart",
      "title": "The Sullivan dictionary from the perspective of dimension theory",
      "abstract": "The Sullivan dictionary provides a conceptual framework to study the relationships between Kleinian groups and rational maps. Stemming from work due to Sullivan in the 1980s, the dictionary now includes numerous analogous results, even with similar proofs. One particularly strong correspondence is that from the perspective of dimension theory, where in both the Kleinian group setting and the rational map setting, many notions of dimension are given by some critical exponent. In this talk, I will discuss how by slightly expanding the family of dimensions considered, in particular to dimensions of Assouad-type, we find a richer family of similarities between the two settings and, perhaps more interestingly, some clear differences. Joint work with Jonathan Fraser.",
      "video": "https://www.youtube.com/watch?v=yZfqaKBZbt4"
    },
    "2020-10-13": {
      "name": "Henna Koivusalo",
      "title": "Linear repetition in polytopal cut and project sets",
      "abstract": "Cut and project sets are aperiodic point patterns obtained by projecting an irrational slice of the integer lattice to a subspace. One way of classifying aperiodic sets is to study repetition of finite patterns, where sets with patterns repeating linearly often, or linearly repetitive sets, can be viewed as the most ordered aperiodic sets. <br>\n<br>\n\nRepetitivity of a cut and project set depends on the slope and shape of the irrational slice. The cross-section of the slice is known as the window. In an earlier work it was shown that for cut and project sets with a cube window, linear repetitivity holds if and only if the following two conditions are satisfied: (i) the set has minimal complexity and (ii) the irrational slope satisfies a certain Diophantine condition. In a new joint work with Jamie Walton, we give a generalisation of this result for other polytopal windows, under mild geometric conditions. A key step in the proof is a decomposition of the cut and project scheme, which allows us to make sense of condition (ii) for general polytopal windows.",
      "video": "https://www.youtube.com/watch?v=fmywdP6gsh8"
    },
    "2020-10-27": {
      "name": "Alex Rutar",
      "title": "Multifractal formalism for self-similar measures with exact overlaps",
      "abstract": "The fine multifractal spectrum of a measure in Euclidean space describes, in some sense, how singular the measure is with respect to Lebesgue measure. A heuristic relationship known as the multifractal formalism states that the fine multifractal spectrum is given by the concave conjugate of the <i>L<sup>q</sup></i>-spectrum of the measure. I will discuss this phenomenon for self-similar iterated function systems in the real line satisfying the weak separation condition, where the multifractal formalism is known not to hold in general.\n<br>\n<br>\nThe main tool I will introduce is a new symbolic encoding of the self-similar set using a weighted directed graph construction, where associated self-similar measures are described by products of non-negative matrices associated with the edges in the graph. A key insight is that, under the weak separation condition, the multifractal formalism is partially characterized by certain properties of the graph itself.",
      "video": "https://www.youtube.com/watch?v=PJa2iJAN2gs"
    },
    "2020-11-03": {
      "name": "Stuart Burrell",
      "title": "Brownian tumbleweed, dimension and the elliptical spiral mapping problem",
      "abstract": "Spirals are exciting objects that spring up throughout nature and mathematics. They arise in turbulent dynamical systems and play an important role in the theory of conformal welding. We introduce elliptical polynomial spirals, a flexible family of planar spirals with differing polynomial rates of decay in the two-axis directions. After setting the scene, we present the various dimensions of these spirals and probe the way they differ via the emerging field of dimension interpolation. Then, we consider the regularity of H&#246;lder maps that deform one spiral into another. Dimension yields an initial bound on the H&#246;lder exponent, which, surprisingly, may be improved upon by analysing the images of spirals under fractional Brownian motion.\n\nThis is based on joint work with Kenneth Falconer and Jonathan Fraser.",
      "video": "https://www.youtube.com/watch?v=FuQaFWZsjmw"
    },
    "2020-11-10": {
      "name": "Tushar Das",
      "title": "A tale of two variational principles",
      "abstract": "Being the best of times and the worst of times... I plan to present two variational principles from two distinct realms of research in dimension theory -- self-affine fractals and metric Diophantine approximation. The talk will be accessible to students and faculty interested in some convex combination of dynamics, Diophantine approximation, and fractal geometry. Most importantly, I hope to present a sampling of open questions and directions that have yet to be explored.",
      "video": "https://www.youtube.com/watch?v=TSKncVoTRZA"
    },
    "2020-11-17": {
      "name": "Natalia Jurga",
      "title": "Box dimension of (×<i>m</i>, ×<i>n</i>) invariant sets",
      "abstract": "We study the box dimensions of sets which are invariant under the toral endormorphism (<i>x</i>,<i>y</i>) &#8614; (<i>mx</i> mod 1, <i>ny</i> mod 1) for integers <i>n</i>><i>m</i> &#8805; 2. This is a fundamental example of an expanding, nonconformal dynamical system, and invariant sets have many subtle properties. The basic examples of such invariant sets are Bedford-McMullen carpets and, more generally, invariant sets are modelled by subshifts on the associated symbolic space. When this subshift is topologically mixing and sofic, the situation is well-understood by results of Kenyon and Peres, in particular the box dimension satisfies a natural formula in terms of entropy and the expansion coefficients <i>m</i>,<i>n</i>.  In this talk we will discuss recent results with Jonathan Fraser on what happens beyond the sofic and mixing case.",
      "video": "https://www.youtube.com/watch?v=NSkEp_N67TE"
    },
    "2020-11-24": {
      "name": "Lawrence Lee",
      "title": "Ledrappier-Young formulae for a family of nonlinear attractors",
      "abstract": "We study a natural class of invariant measures supported on the attractors of a family of nonlinear, non-conformal iterated function systems introduced by Falconer, Fraser and Lee. These are pushforward quasi-Bernoulli measures, a class which includes Gibbs measures. We show that these measures are exact dimensional and that their exact dimensions satisfy a Ledrappier-Young formula. Based on joint work with Natalia Jurga.",
      "video": "https://www.youtube.com/watch?v=DQBEP9ZURq8"
    },
    "2020-12-01": {
      "name": "Alexia Yavicoli",
      "title": "The density of sets containing large similar copies of finite sets",
      "abstract": "I will present a result that shows that any Lebesgue-measurable set in &#8477;<sup><i>d</i></sup> with density larger than (<i>n-2</i>)/(<i>n-1</i>) contains similar copies of every <i>n</i>-point set at all sufficiently large scales. I will also give an example to show that the density required to guarantee all large similar copies of <i>n</i>-point sets tends to 1 at a rate 1- O(<i>n</i><sup>-1/5</sup>log<i>n</i>). Joint work with Kenneth Falconer and \nVjekoslav Kova&#269;.",
      "video": "https://www.youtube.com/watch?v=lVL71S7Vr30"
    }
  },
  "Summer 2020": {
    "2020-05-26": {
      "name": "Natalia Jurga",
      "title": "Hausdorff dimension of self-projective sets",
      "abstract": "A finite set of matrices <i>A</i> &#8838; SL(2,&#8477;) acts on one-dimensional real projective space &#8477;P<sup>1</sup> through its linear action on &#8477;<sup>2</sup>. In this talk we will be interested in the smallest closed subset of &#8477;P<sup>1</sup> which is invariant under the projective action of <i>A</i>. Recently, Solomyak and Takahashi proved that if <i>A</i> is uniformly hyperbolic and satisfies a Diophantine property, then the invariant set has Hausdorff dimension equal to the minimum of 1 and the critical exponent. In this talk we will discuss an extension of their result beyond the uniformly hyperbolic setting. This is based on joint work with Argyrios Christodoulou.",
      "video": "https://www.youtube.com/watch?v=YC_3GzYyTAI"
    },
    "2020-06-16": {
      "name": "Thomas Jordan",
      "title": "Dimension of projections of ergodic measures onto self-similar sets",
      "abstract": "On the line Hochman has a result showing that the dimension of a self-similar measure is given by the minimum entropy divided by lyapunov exponent and 1 as long as an exponential separation property is satisfied. We will show how this can be extended to the dimension of all ergodic measures projected onto self-similar sets satisfying the same exponential separation property. The main tool used will be Shmerkin's result on the <i>L</i><sup><i>q</i></sup> dimensions of self-similar measures. This is joint work with Ariel Rapaport.",
      "video": "https://www.youtube.com/watch?v=bG1GA68Dbz8"
    },
    "2020-06-23": {
      "name": "Feyisayo Olukoya",
      "title": "The group of automorphisms of the shift dynamical system and the Higman-Thompson groups",
      "abstract": "We give a survey of recent results exploring connections between the Higman-Thompson groups and their automorphism groups and the group of autmorphisms of the shift dynamical system.  Our survey takes us from dynamical systems to group theory via groups of homeomorphisms with a segue through combinatorics, in particular, de Bruijn graphs.\nJoint work with Collin Bleak, Peter Cameron, and Jim Belk.",
      "video": "https://www.youtube.com/watch?v=WIL2fUpdzU0"
    },
    "2020-06-30": {
      "name": "Amlan Banaji",
      "title": "New intermediate dimensions",
      "abstract": "The intermediate dimensions, introduced by Falconer, Fraser and Kempton, are a family of dimensions which lie between the Hausdorff and box-counting dimensions, parameterised by &#952; &#8712; [0,1]. I will summarise some of the properties of the intermediate dimensions and introduce a generalisation of them which gives finer geometric information about sets for which the intermediate dimensions are discontinuous at &#952; = 0.",
      "video": ""
    },
    "2020-07-07": {
      "name": "Felipe Ramírez",
      "title": "Remarks about inhomogeneous pair correlations",
      "abstract": "A sequence <i>a<sub>n</sub></i> of natural numbers is said to have metric Poissonian pair correlations (MPPC) if for almost every real number <i>x</i> the associated sequence <i>xa<sub>n</sub></i> (mod 1) on the circle has asymptotically Poissonian pair correlations. Informally speaking, this means that the points of the sequence clump together to the same degree that they would if they had been picked randomly. For example, the sequence of natural numbers does not have MPPC, while the sequence of square numbers does. Generally, if a sequence has too much additive structure, like the natural numbers, then it will not have MPPC. If it has very little additive structure, like the squares or the powers of two, then it will have MPPC. But there is a zone in between \"too much\" and \"very little\" additive structure where the picture is not so clear, and there has been a lot of work devoted to finding a threshold separating sequences with MPPC from those without, based on what is called the sequence's \"additive energy.\" I will survey this work, and I will discuss an associated inhomogeneous problem where the corresponding questions seem to be easier to answer.",
      "video": "https://www.youtube.com/watch?v=aiDOeb2XpYk"
    },
    "2020-07-14": {
      "name": "Balázs Bárány",
      "title": "On the multifractal spectrum of weighted Birkhoff averages",
      "abstract": "The multifractal spectrum of Birkhoff averages over shift spaces or self-conformal sets has been studied widely and is relatively well understood. In this talk, we study the multifractal spectra of weighted Birkhoff averages over the shift space. Under some conditions on the weights, we calculate the spectrum. Our methods are applicable when the weights are defined by the M&#246;bius function with potentials depending on the first symbol. This is joint work with Michal Rams and Ruxi Shi.",
      "video": "https://www.youtube.com/watch?v=PNwZYMkFDoc"
    },
    "2020-07-21": {
      "name": "Clarence Chen",
      "title": "Dimensions of the popcorn graph",
      "abstract": "The popcorn function, also known as Thomae's function or the modified Dirichlet function, is an important example in real analysis. The corresponding graph set, called the popcorn graph, contains fractal and number theoretical structures. In this talk, we will talk about properties and the dimensions of the popcorn graph, which seems straightforward but relies on delicate counting arguments and some deep results from number theory. This is joint work with Jonathan Fraser and Han Yu.",
      "video": "https://www.youtube.com/watch?v=XZgtJ9poC8Y"
    },
    "2020-08-04": {
      "name": "Nayab Khalid",
      "title": "The rotation distance between two binary rooted trees",
      "abstract": "A rotation in a binary tree is a local restructuring of the tree, executed by collapsing an internal edge of the tree to a point, thereby obtaining a node with three children, and then re-expanding the node of order three in the alternative way. The rotation distance between a pair of trees with the same number of nodes is the minimum number of rotations needed to convert one tree into another. There has been a great deal of interest in the problems (initially presented by Culik and Wood in 1982 and Sleater, Tarjan and Thurston in 1988): what is the maximum rotation distance between any pair of n-node binary trees? Is there a polynomial time algorithm (in the number of nodes of the trees) to determine the rotation distance between a given pair of trees?\n<br>\n<br>\nThere is a natural link between the rotation distance problem and Thompson's group F, which has been extensively studied. In this talk, I will discuss a remarkable result by Dehornoy (2010) where he explores this link but ultimately leaves an open problem. Time permitting, I will also discuss a result in my PhD thesis which might provide a solution to this open problem.",
      "video": "https://www.youtube.com/watch?v=HSiPnAQj6Vs"
    },
    "2020-08-11": {
      "name": "István Kolossváry",
      "title": "Intermediate dimensions of Bedford-McMullen carpets",
      "abstract": "The intermediate dimensions of a set &#923;, elsewhere denoted by dim<sub>&#952;</sub> &#923;, interpolate between its Hausdorff and box dimensions using the parameter &#952; &#8712; [0,1]. Determining a precise formula for dim<sub>&#952;</sub> &#923; is particularly challenging when &#923; is a Bedford-McMullen carpet with distinct Hausdorff and box dimension. In this talk, after giving an overview, we will present an argument that shows that dim<sub>&#952;</sub> &#923; is strictly less than the box dimension of &#923; for every &#952; < 1. Time permitting, we will also show how to improve on the lower bound obtained by Falconer, Fraser, and Kempton.",
      "video": "https://www.youtube.com/watch?v=NyRuZA6EkWU"
    },
    "2020-08-25": {
      "name": "Junda Zhang",
      "title": "The Derrida-Retaux System: Critical value and infinite transition order",
      "abstract": "The Derrida-Retaux System is a simple dynamical system on random variables in statistical physics. The concept was formally raised by Bernard Derrida and Martin Retaux in 2014, as a toy model for the longstanding Poland-Scheraga model of DNA transition. \n\nAn example would be the initial distribution <i>X</i><sup> 0</sup> which takes value 0 with probability 1-<i>p</i> and takes value 2 with probability <i>p</i>. The iteration relationship is that <i>X</i><sup> <i>n</i>+1</sup> = (<i>X</i><sup> <i>n</i></sup>+<i>Y</i><sup> <i>n</i></sup>-1)<sup>+</sup> (where (<i>a</i>)<sup>+</sup> = max{<i>a</i>,0}), where <i>Y</i><sup> <i>n</i></sup> is i.i.d with <i>X</i><sup> <i>n</i></sup>.\n\nThe free energy is defined to be the limit of &#120124;(<i>X</i><sup> <i>n</i></sup>)/2<sup><i>n</i></sup>. There exists a critical value <i>p<sub>c</sub></i> such that when <i>p < p<sub>c</sub></i> the free energy is 0, but when <i>p > p<sub>c</sub></i> the free energy is positive. \n<br>\n<br>\nSurprisingly in 1984, Collect, Eckmann, etc. discovered a precise formula to calculate <i>p<sub>c</sub></i> when the initial distribution is integer-valued from the viewpoint of real dynamics. In this talk I will mainly present a 'surprising' result in my undergraduate thesis: their formula holds if and only if the initial distribution is integer-valued. I will also talk about a recent breakthrough on the phase transition order by Shi, etc. (2019).",
      "video": "https://www.youtube.com/watch?v=zsjyj0p234I"
    }
  },
  "Spring 2020": {
    "2020-02-04": {
      "name": "Catherine Bruce",
      "title": "Using Furstenberg's CP-chain method to prove strong projection theorems",
      "abstract": "We start with two concepts, both originating more than 50 years ago. Marstrand's 1954 projection theorem regarding orthogonal projections of Borel sets in the plane, and Furstenberg's sumset conjecture, regarding sumsets of sets invariant under T<sub>2</sub>(x)=2x mod1 and T<sub>3</sub>(x)=3x mod1. Hochman and Shmerkin's breakthrough paper in 2012 provided both a strengthening of Marstrand's projection theorem for self-similar sets with irrational rotations, and a full resolution of Furstenberg's sumset conjecture. The key to both proofs is the method of CP-chains, a theory devised by Furstenberg himself and developed by Hochman and Shmerkin to tackle problems in fractal geometry and geometric measure theory. We will discuss this method and some of the numerous results it has helped to prove in recent years.",
      "video": ""
    },
    "2020-02-11": {
      "name": "Jonathan Fraser",
      "title": "Fun with fractals, Fourier transforms, and fractional Brownian motion",
      "abstract": "I will discuss the Fourier transform in the context of fractal geometry.  This will involve formulating Fourier analytic analogues of well-known results in fractal geometry, such as Marstrand's slicing theorem.  Some of this will be joint work with Tuomas Orponen and Tuomas Sahlsten.",
      "video": ""
    },
    "2020-02-18": {
      "name": "Lawrence Lee",
      "title": "L<sup>q</sup>-spectra of measures on non-conformal attractors",
      "abstract": "We study Bernoulli measures in the plane supported on sets defined by iterated function systems consisting of nonlinear maps. These maps have triangular Jacobian matrices and satisfy an appropriate separation condition. Using ideas from thermodynamic formalism we are able to calculate the L<sup>q</sup>-spectrum of such measures and as a corollary we obtain the box dimension of the sets they are supported on.",
      "video": ""
    },
    "2020-02-25": {
      "name": "Liam Stuart",
      "title": "The Assouad spectrum of Kleinian limit sets",
      "abstract": "The dimension theory regarding limit sets of geometrically finite Kleinian groups has a long history, dating back to work from Patterson in 1976 regarding the Hausdorff dimension, to Stratmann and Urbanski's work in 1996 on the box dimension, to more recent work done by Fraser regarding the Assouad dimension. I will discuss some recent work regarding the Assouad spectrum of these limit sets. Joint work with Jonathan Fraser.",
      "video": ""
    },
    "2020-03-03": {
      "name": "Mike Todd",
      "title": "How close do orbits get?",
      "abstract": "Given a dynamical system f and two points x and y, a natural question is: given a time n what is the minimal distance between the n-orbits of x and y?  (I.e. the smallest distance between the set {x, f(x),..., f<sup>n-1</sup>(x)} and {y, f(y),..., f<sup>n-1</sup>(y)}).  It turns out that this can be written in terms of the correlation dimension of the measure at hand.  This dimension is poorly understood for all except very simple cases, but I'll present some examples of interesting slowly mixing cases where it can be computed and this orbit approach problem solved.  This is joint work with Jerome Rousseau (Bahia/Porto).",
      "video": ""
    },
    "2020-03-10": {
      "name": "Lars Olsen",
      "title": "Distribution of digits in integers",
      "abstract": "As an example we consider discrete Besicovitch-Eggleston\nsubsets of the positive integers &#8469; based on the frequencies\nof digits in the N-ary expansion of positive integers, and show that\nthe \"fractional\" dimensions of these sets satisfy a formula analogous\nto the classical Besicovitch-Eggleston dimension formula for the\nHausdorff dimension of the usual Besicovitch-Eggleston subsets of &#8477;.",
      "video": ""
    }
  },
  "Autumn 2019": {
    "2019-09-24": {
      "name": "Jonathan Fraser",
      "title": "The Assouad dimensions of projections of planar sets",
      "abstract": "How dimension behaves under projection from the plane onto lines is a well-studied problem in fractal geometry. For many notions of dimension there is an 'almost sure constancy result' - often referred to as a 'Marstrand phenomenon.' The Assouad dimension behaves rather differently and this will be the focus of the talk. The recent work I will talk about is joint with Antii Kaenmaki (University of Eastern Finland).",
      "video": ""
    },
    "2019-10-01": {
      "name": "Abel Farkas",
      "title": "Geometric measure theory of the Brownian path",
      "abstract": "Let &nu; be a deterministic measure. We wish to find a random measure that solves E(&mu;) = &nu; while &mu; is supported on the Brownian path \nand is nicely spread so we can use it as a tool for geometric measure theory of the Brownian path. We describe when a problem\ncan be solved and we provide a solution. We outline the possible application of the random measures. The theory is developed for more general\nclosed sets than the Brownian path.",
      "video": ""
    },
    "2019-10-08": {
      "name": "Mike Todd",
      "title": "When entropy escapes",
      "abstract": "Lots of mathematical questions can be interpreted as \"if this sequence of objects converges, do certain associated qualities of those\nobjects converge?\". In this talk the objects will be measures associated to a dynamical system and the quality will be entropy.\nWhen a system is non-compact, then mass can escape in the limit: here we'll consider how entropy can converge \"modulo escape\nof mass\". This is joint work with Godofredo Iommi and Anibal Velozo.",
      "video": ""
    },
    "2019-10-15": {
      "name": "Collin Bleak",
      "title": "Some free actions for one-sided shift spaces",
      "abstract": "Boyle and Krieger [1987] give a complete invariant for conjugacy of automorphisms for one-sided shifts of finite type.  If two automorphisms are not conjugate, then in finite time you can detect this using the `gyration' and `sign' vectors (infinite vectors generated from the automorphisms taking values, in the first case, in Z/nZ in the nth coordinate, and in the second case,  in Z/2Z in each coordinate).  However, while these invariants can be constructed from given automorphisms, finding an automorphism with given invariance vectors is not an easy task (and in general, one cannot just pick any two vectors).  \n\n  Boyle has proposed the following question: Consider the full (one-sided) shift on n-letters.  Does there exists an automorphism A of order n acting freely on the shift space (every point has an orbit of length n under the action of the automorphism), but where A is not conjugate to a permutation on n letters?  We will discuss these invariants, and then, give an automorphism of the sort in Boyle's question.  Joint with Feyisayo Olukoya.",
      "video": ""
    },
    "2019-10-29": {
      "name": "Pablo Shmerkin",
      "title": "Regular sets and measures and regularization",
      "abstract": "I will discuss a notion of regular set and measure (roughly, a homogeneous Moran construction), and how to extract \"large\" regular sets and measures from arbitrary ones. Even though this is essentially just an application of the pigeonhole principle, it plays a key role in some deep theorems of Bourgain (where I learned about it) and also in my recent work on distance sets and intersections of Cantor sets.",
      "video": ""
    },
    "2019-11-05": {
      "name": "István Kolossváry",
      "title": "Counting intersections in transversally overlapping self-affine planar carpets",
      "abstract": "The first part of the talk will give a broader overview of where this joint work with Karoly Simon fits into the literature about self-affine planar carpets. Then more detail will be given about the result for box dimension. In particular, the key argument for counting intersecting boxes under a certain transversality condition will be presented.",
      "video": ""
    },
    "2019-11-12": {
      "name": "Alexia Yavicoli",
      "title": "On the dimension of sets that avoid approximate arithmetic progressions",
      "abstract": "I will present quantitative estimates for the supremum of the Hausdorff dimension of sets in the real line which avoid e-approximations of arithmetic progressions. These estimates improve considerably the bounds given by Fraser, Saito and Yu (IMRN, 2019), in particular answering a question left open in that paper. I will also show that for this problem, Hausdorff dimension is equivalent to box or Assouad dimension. Joint work with J. Fraser and P. Shmerkin.",
      "video": ""
    },
    "2019-11-19": {
      "name": "Kenneth Falconer",
      "title": "Symmetry, enumeration and topology of self-similar fractals",
      "abstract": "I will talk about methods for classifying self-similar sets by symmetry or topology and enumerating such classes of fractals.",
      "video": ""
    },
    "2019-11-25": {
      "name": "Sam Colvin",
      "title": "Minimising Hausdorff Dimension under Hölder Equivalence",
      "abstract": "Conformal dimension is a powerful tool in the study of metric spaces. It was originally introduced to study rank one symmetric spaces, but has also proved useful in the study of boundaries of hyperbolic groups and other fractal metric spaces. Considering conformal dimension within the framework of Geometric Group Theory, I have defined a related notion that I am calling H&#246;lder dimension, which is an invariant of H&#246;lder equivalence in the same way that conformal dimension is an invariant of quasi-symmetric equivalence. I will define what H&#246;lder dimension is, illustrate why it is a natural concept to consider, present some of my results regarding H&#246;lder dimension, and conclude with some open questions.",
      "video": ""
    },
    "2019-11-26": {
      "name": "Stuart Burrell",
      "title": "Projections, Capacities and Intermediate Dimensions",
      "abstract": "Projections have received sustained interest since Marstrand's seminal result in 1954 on the Hausdorff dimension of projections in the plane. To begin, we will introduce key developments from 1954 to the present day. This aims to provide context and motivation to recent results on the intermediate dimensions of projections. To conclude, some rather surprising corollaries on the Hausdorff and box dimensions of projections will be discussed. The talk will presume little prior knowledge, and so will be accessible even if you are unfamiliar with many of the concepts above.",
      "video": ""
    }
  },
  "Summer 2019": {
    "2019-06-19": {
      "name": "Antti Käenmäki",
      "title": "Assouad dimension of planar self-affine sets",
      "abstract": "We consider planar self-affine sets X satisfying the strong separation condition and the projection condition. We show that any two points of X, which are generic with respect to a self-affine measure having simple Lyapunov spectrum, share the same collection of tangent sets. We also calculate the Assouad dimension of X and show that it is minimal for the conformal Assouad dimension. The talk is based on joint work with Balázs Bárány and Eino Rossi.",
      "video": ""
    }
  },
  "Spring 2019": {
    "2019-02-05": {
      "name": "Silouanos Brazitikos",
      "title": "Uniform cover inequalities for the volume of coordinate sections and projections of convex bodies",
      "abstract": "The classical Loomis-Whitney inequality and the uniform cover inequality of Bollobás and Thomason provide upper bounds for the volume of a compact set in terms of its lower dimensional coordinate projections. We provide further extensions of these inequalities in the setting of convex bodies. We also establish the corresponding dual inequalities for coordinate sections; these uniform cover inequalities for sections may be viewed as extensions of Meyer's dual Loomis-Whitney inequality.",
      "video": ""
    },
    "2019-02-12": {
      "name": "Collin Bleak",
      "title": "Separating groups through applying dynamical ideas",
      "abstract": "This talk will feature joint work with Daniel Lanoue on the finitely presented infinite simple Brin-Thompson groups nV.  In Brin's introductory paper in 2004, he introduces the groups nV (for positive integers n); a new family of infinite, simple, finitely presented groups modelled on R Thompson's group V = 1V.  In the paper, he was able to show that 1V was not isomorphic to 2V, but for larger n, the isomorphism/non-isomorphism question remained unclear.  We showed (circa 2007) that a simple dynamical invariant (still measured by groups!) is able to separate all of these groups from each other.",
      "video": ""
    },
    "2019-02-19": {
      "name": "Mike Todd",
      "title": "Continuity of entropy in non-compact systems",
      "abstract": "For compact dynamical systems, entropy is usually upper semi-continuous: i.e., for a convergent sequence of invariant measures the entropy may jump up in the limit, but it can't jump down.  I'll give an idea of why this should be true and then consider the case of non-compact shift maps, where we can prove the same result.  The main idea is to transfer the problem to loop graphs and loop systems, which can then be embedded into a compact shift.  This is joint work with Godofredo Iommi and An&iacute;bal Velozo.",
      "video": ""
    },
    "2019-02-26": {
      "name": "Han Yu",
      "title": "Multi-rotations on the circle and some related problems",
      "abstract": "Given irrational numbers a,b and a sequence S over digits a,b, we can construct an orbit by adding a or b in each step according to the sequence S. It is proven by Katznelson that the closure of such an orbit can have zero Hausdorff dimension. On the other hand, it is also known that such an orbit must have lower box dimension at least 1/2. We will discuss some further results, related problems as well as how they are related to the affine embedding problem between self-similar sets.",
      "video": ""
    },
    "2019-03-05": {
      "name": "Julio Aroca Lobato",
      "title": "The conjugacy problem for a family of Thompson-like groups",
      "abstract": "In this talk we give a brief introduction to Thompson's groups F, T and V, three subgroups of the group of homeomorphisms of the Cantor set. They were defined by Richard Thompson in 1965, who used them to construct finitely presented groups with unsolvable word problems. We then study the solution of Belk-Matucci to the conjugacy problem for these groups, using a topological approach.\n<br>\nNext we will introduce a larger class of subgroups of the homeomorphism group of the Cantor set, a family of Thompson-like groups. We will explain how to extend the ideas of Belk-Matucci to this setting, in order to solve the conjugacy problem, In addition, this implies that certain pairs of these Thompson-like groups are non-isomorphic.",
      "video": ""
    },
    "2019-03-12": {
      "name": "Stuart Burrell",
      "title": "TBD",
      "abstract": "",
      "video": ""
    },
    "2019-04-02": {
      "name": "Kenneth Falconer",
      "title": "Box dimensions of projections and exceptional directions",
      "abstract": "Same as the title.",
      "video": ""
    },
    "2019-04-09": {
      "name": "Jonathan Fraser",
      "title": "The winding problem",
      "abstract": "Given two homeomorphic subsets of the plane, how regular can a homeomorphism be mapping one set to the other? Here, \"regular\" refers to Lipschitz or Holder conditions. I will discuss a concrete example of this type of question, known as the \"winding problem\", where the sets in question are a line segment and a spiral. This problem has applications and origins in conformal welding and the modelling of turbulence in fluid dynamics. Given time, there will be a competitive audience participation section of the talk where we engage in the fractal analogue of the grand national.",
      "video": ""
    },
    "2019-04-16": {
      "name": "Sascha Troscheit",
      "title": "Lower Regularity of Measures",
      "abstract": "The lower Assouad dimension of a measure (also known as the lower regularity dimension) quantifies the \"inverse doubling\" of a measure. In this talk we investigate the regularity of measures from this perspective and show that many natural measures have positive lower Assouad dimension, i.e. are inverse doubling. This is in stark contrast to the doubling property: measures are generically far from doubling.\nWe will relate this property to L^p-improving measures, a class of measures that improve the regularity of (other) measures on convolution.",
      "video": ""
    },
    "2019-04-23": {
      "name": "David Beltran",
      "title": "Regularity of maximal functions",
      "abstract": "It is known that fractional integrals and the classical fractional maximal function are smoothing operators, in the sense that they map Lebesgue spaces into first order Sobolev spaces. We will show that this phenomenon continues to hold for the fractional spherical maximal function when the dimension of the ambient space is greater than or equal to 5. Moreover, we will discuss the known and open questions regarding the derivative of the Hardy--Littlewood maximal function and its fractional counterpart. This is joint work with Joao P. G. Ramos and Olli Saari.",
      "video": ""
    },
    "2019-04-30": {
      "name": "Douglas Howroyd",
      "title": "Are pusforwards of doubling measures onto graphs of Brownian motion also doubling?",
      "abstract": "Almost surely no.",
      "video": ""
    },
    "2019-05-07": {
      "name": "John Mackay",
      "title": "Boundaries of relatively hyperbolic groups",
      "abstract": "A key invariant of a hyperbolic group is its boundary at infinity, which is a metric space\ncanonically defined up to quasisymmetry.  In this talk I will discuss on-going work with Alessandro Sisto\nlooking at the metric structure of the boundary at infinity of relatively hyperbolic groups.",
      "video": ""
    }
  },
  "Autumn 2018": {
    "2018-09-25": {
      "name": "Sascha Troscheit",
      "title": "Galton-Watson trees: Big, small, and sometimes continuous.",
      "abstract": "Galton-Watson trees are trees that arise from a simple probabilistic model that was first used to describe the extinction of family names in patrilineal family name systems. The model is based on the premise that each individual (node in the tree) has a random number of descendants (sub-nodes/children) which is chosen independently from all other individuals but according to the same distribution. These trees (and their Gromov boundary) arise in a variety of fields and can be used as a model for stochastic self-similarity when endowed with a suitable metric.\n<br>\n<br>\nIn this colloquium-style talk, I will shed some light on the large and small scale behaviour of such trees under a variety of metrics: Some give compact fractals, whereas others give unbounded random metric spaces. I will exhibit dimension theoretic properties that arise from statistical properties and present results on quasi-isometries between random metric spaces.\nGiven time, I will talk about a special random metric space that one can obtain by rescaling and its unusual dimension theoretic property: It `looks' planar, but cannot `live' in R<sup>d</sup>.",
      "video": ""
    },
    "2018-10-09": {
      "name": "Stuart Burrell",
      "title": "Dimension drop and inhomogeneous self-affine sets",
      "abstract": "Exploring the conditions sufficient or necessary for dimension drop to occur between the affinity and Hausdorff dimensions in homogeneous settings has been a major open problem in fractal geometry since the 1980s.  This talk will focus on a single question: given an affine homogeneous system exhibiting dimension drop, what conditions on the condensation set raise the dimension back up to the typical expected values? To set the scene, we'll also introduce the area and survey a few key past and recent dimension results.",
      "video": ""
    },
    "2018-10-16": {
      "name": "Yiftach Dayan",
      "title": "Diophantine approximations on random fractals.",
      "abstract": "We will present a model for the construction of random fractals which is called fractal percolation. The result that will be presented in this talk states that a typical fractal percolation set E intersects every set which is winning for a certain game that is called the \"hyperplane absolute game\", and the intersection has the same Hausdorff dimension as E. An example of such a winning set is the set of badly approximable vectors in dimension d. <br>\nIn order to prove this theorem one may show that a typical fractal percolation set E contains a sequence of Ahlfors-regular subsets with dimensions approaching the dimension of E, where all the subsets in this sequence are also \"hyperplane diffuse\", which means that they are not concentrated around affine hyperplanes when viewed in small enough scales. <br>\nIf time permits, we will discuss the method of the proof of this theorem as well as a generalization to a more general model for random construction of fractals which is given by projecting Galton-Watson trees against any similarity IFS whose attractor is not contained in a single affine hyperplane.",
      "video": ""
    },
    "2018-10-22": {
      "name": "Alexia Yavicoli",
      "title": "Patterns in fractal sets.",
      "abstract": "There is a long history about the relationship between the size of a set and the presence of geometric patterns, such as arithmetic progressions. It is well known that sets of positive Lebesgue measure contain a homothetic copy of every finite pattern. We will see that Hausdorff measure (and Hausdorff dimension) cannot be used to detect existence or nonexistence of patterns inside sets. So, if we want to guarantee the presence of patterns in a set, we need a different notion of size. I will talk about a work in progress in which I guarantee the presence of certain patterns in sets of large thickness. This two concepts had not been connected until now. The proof is simple and it is based on variants of Schmidt's game. I will also share some questions with you.",
      "video": ""
    },
    "2018-10-23": {
      "name": "Pablo Shmerkin",
      "title": "Some new results and some open problems about the middle-thirds Cantor set.",
      "abstract": "I will survey some recent results and some open problems involving the middle-thirds Cantor set, and in particular its behaviour under arithmetic sums, intersections, and unions of many copies.",
      "video": ""
    },
    "2018-10-30": {
      "name": "Keith Rogers",
      "title": "The polynomial Wolff axioms and applications.",
      "abstract": "",
      "video": ""
    },
    "2018-11-06": {
      "name": "Lawrence Lee",
      "title": "L<sup>q</sup>-spectra of self-affine measures: closed forms, counterexamples, and split binomial sums.",
      "abstract": "We study the L<sup>q</sup>-spectra of self-affine measures in the plane. We show that the L<sup>q</sup>-spectrum is not in general given by the expected closed form formula.",
      "video": ""
    },
    "2018-11-13": {
      "name": "Jonathan Hickman",
      "title": "High dimensional Kakeya maximal estimates via polynomial partitioning.",
      "abstract": "I will describe an approach to studying the Kakeya maximal function in high dimensions via the Guth--Katz polynomial partitioning method. Although the approach does not currently produce better bounds than the record set by Katz--Tao, it is rather flexible, provides a lot of interesting structural information and gives rise to some interesting algebraic/geometric problems.",
      "video": ""
    },
    "2018-11-20": {
      "name": "Jim Belk",
      "title": "A geometric solution to the twisted rabbit problem",
      "abstract": "Thurston's theorem in complex dynamics implies that every finite-sheeted branched cover of the complex plane by itself whose ramification points are periodic can be deformed to polynomial with periodic critical points.  Hubbard's famous twisted rabbit problem -- first solved by Bartholdi and Nekrashevych using iterated monodromy groups -- asks for an algorithm to find this polynomial from the branched cover.  In this talk I will discuss a new solution to the twisted rabbit problem based on the geometry of trees in the complex plane.  This is joint work with Justin Lanier, Dan Margalit, and Rebecca Winarski.",
      "video": ""
    },
    "2018-11-27": {
      "name": "Han Yu",
      "title": "Incompatibility of geometric and arithmetic sequences",
      "abstract": "In this talk, I will show that geometric and arithmetic sequences have little in common. Two scenarios will be discussed. First, I will present a number theoretic problem which originates from a math olympiad question which asks whether for every integer m and k there is an integer n such that 2<sup>n</sup>+n&equiv; k mod m. Curiously, this result has a continuous version. We shall see that the fractional parts of 2<sup>n</sup> d+nc for n&#8805; 0  form a rather large set in [0,1].",
      "video": ""
    },
    "2018-12-04": {
      "name": "Collin Bleak",
      "title": "",
      "abstract": "",
      "video": ""
    }
  },
  "Spring 2018": {
    "2018-02-06": {
      "name": "Jonathan Fraser",
      "title": "Limit sets of Kleinian groups and dimension.",
      "abstract": "Kleinian groups act discretely on hyperbolic space and give rise to beautiful and intricate mathematical objects, such as tilings and fractal limit sets. The dimension theory of these limit sets has a particularly interesting history, the first calculation of the Hausdorff dimension going back to seminal work of Patterson from the 1970s.  In the geometrically finite case, the Hausdorff, box-counting, and packing dimensions are all given by the Poincare exponent.  I will discuss recent work on the Assouad dimension, which is not necessarily given by the Poincare exponent in the presence of parabolic points.",
      "video": ""
    },
    "2018-02-13": {
      "name": "Han Yu",
      "title": "On Ka-problems and some variants.",
      "abstract": "In this talk we discuss a variant of the Kakeya problem. Let us consider a set in the plane whose difference set contains the unit circle. How large is this set in terms of the Hausdorff dimension, box dimensions and the Assouad dimension? It is known that the Hausdorff dimension of such set can be 0 and the lower box dimension must be at least 0.5. In this talk we will discuss some further results and at the same time we will have a lot of fun in discrete geometry.",
      "video": ""
    },
    "2018-02-20": {
      "name": "Collin Bleak",
      "title": "Prefix exchanges, the CoCF property, and topological conjugation.",
      "abstract": "We show, by adapting a dynamical argument of Lehnert and Schweitzer involving actions on Cantor space, that an apparent broadening of the class of known CoCF groups (a class of groups defined by some formal language criteria) actually adds no new groups to the class, once more producing a result in line with Lehnert's Conjecture.  Joint with Jim Belk and Francesco Matucci.",
      "video": ""
    },
    "2018-02-27": {
      "name": "Douglas Howroyd",
      "title": "Distance Sets: Subtraction is essentially addition.",
      "abstract": "One can note that sumsets and difference sets are somewhat similar in structure. It is therefore interesting to use some ideas from the study of sumsets to get new bounds on the dimensions of distance sets. We obtain bounds on the Assouad and upper box dimension of the distance set of F with respect to the respective dimension of F which improve our knowledge for sets of small dimension. I will make these bounds precise and then explain how previous work on sumsets can be used to int the proofs. This is joint work with Jon and Han.",
      "video": ""
    },
    "2018-03-13": {
      "name": "Lars Olsen",
      "title": "Average distances in graph-directed constructions.",
      "abstract": "We study several distinct notions of average distances between points\nbelonging to graph-directed self-similar subsets of  the real line.\nIn particular,  we compute the average distance with respect to\ngraph-directed self-similar measures, and with respect to the normalised Hausdorff measure.\n\nOur result have several application.. For example, if  T denotes the set of those real numbers x in the unit\ninterval for which any 3 consecutive binary digits x sum up to at least 2 (so T is the celebrated Drobot-Turner set),\nthen the average distance between two randomly chosen points in T equals\n\n( 4444&lambda;<sup>2</sup> +  2071&lambda;  +  3030  ) /  (12141&lambda;<sup>2</sup>  +  5650&lambda;  +  8281)   =  0.36610656...,\n\nwhere &lambda; is the unique positive real number such that  &lambda;<sup>3</sup>  -  &lambda;<sup>2</sup>  -  1 = 0..\nThis is joint work with Angela Richardson.",
      "video": ""
    },
    "2018-04-03": {
      "name": "Kenneth Falconer",
      "title": "Strong Marstrand theorems and properties of line sets.",
      "abstract": "We will discuss 'strong' versions of Marstrand's projection theorems and\napplications to dimensions of plane sets formed by collections of lines and subsets\nof lines, with higher dimensional analogues. This is joint work with Pertti Mattila.",
      "video": ""
    },
    "2018-04-10": {
      "name": "Nayab Khalid",
      "title": "A Presentation for Thompson's Group F.",
      "abstract": "I will present our recent work into the development of a new presentation of R. Thompson's group F, \nwhich reflects its symmetries and other dynamical properties.",
      "video": ""
    },
    "2018-04-17": {
      "name": "Mike Todd",
      "title": "Statistical stability: how to prove it?",
      "abstract": "Statistical stability means that the statistical limit laws for a dynamical system move continuously under small perturbations of the measure on the system.  I'll give an idea of how inducing methods can be employed to prove statistical stability and give some worked examples.",
      "video": ""
    },
    "2018-04-24": {
      "name": "Stuart Burrell",
      "title": "Dimension and measure for inhomogeneous attractors",
      "abstract": "We'll introduce and talk about recent and past results on the upper box dimension of inhomogeneous attractors generated from iterated functions systems.\nThis has applications for affine systems with affinity dimension less than one and systems satisfying bounded distortion, such as conformal systems in dimensions greater than one. \nIn particular, this generalises the result of Fraser on self-similar sets. We also apply the methods developed to investigate the Hausdorff measure at the critical value.",
      "video": ""
    },
    "2018-05-01": {
      "name": "Lawrence Lee",
      "title": "Closed form expressions for L<sup>q</sup> spectra",
      "abstract": "In 2013 Fraser found a closed form expression for the L<sup>q</sup> spectrum of a certain class of self-affine measures, however in order to do so he required some assumptions which do not appear to arise naturally. Here we discuss our attempts to remove them.",
      "video": ""
    },
    "2018-05-16": {
      "name": "Antti Käenmäki",
      "title": "Dimension drop conjecture for self-conformal sets",
      "abstract": "We show that any Hausdorff measurable subset of self-conformal sets has comparable Hausdorff measure and Hausdorff content. In particular, this proves that self-conformal sets with positive Hausdorff measure are Ahlfors regular, irrespective of separation conditions. When restricting to the real line and self-conformal sets with Hausdorff dimension strictly less than one, we additionally show that Ahlfors regularity is equivalent to the weak separation condition. In fact, we resolve a self-conformal extension of the dimension drop conjecture for self-conformal sets with positive Hausdorff measure by showing that its Hausdorff dimension falls below the expected value if and only if there are exact overlaps. The talk is based on a recent work with Sascha Troscheit.",
      "video": ""
    }
  },
  "Autumn 2017": {
    "2017-09-17": {
      "name": "Hiroki Takahashi",
      "title": "Lyapunov optimization for non-generic one-dimensional expanding Markov maps.",
      "abstract": "For a non-generic, yet dense subset of $C^1$ expanding Markov maps of the interval\nwe prove the existence of uncountably many Lyapunov optimizing measures which are ergodic,\nfully supported and have positive entropy. These measures are equilibrium states for some\nH\\\"older continuous potentials. We also prove the existence of another non-generic dense subset\nfor which the optimizing measure is unique and supported on a periodic orbit.\nA key ingredient is a new $C^1$ perturbation lemma which allows us to interpolate\nbetween expanding Markov maps and the shift map on a finite number of symbols.\nJoint work with Mao Shinoda (Keio University).",
      "video": ""
    },
    "2017-10-03": {
      "name": "Jonathan Fraser",
      "title": "(Almost) arithmetic progressions and dimension.",
      "abstract": "An old conjecture of Erdos-Turan states that any set of positive integers whose reciprocals form a divergent series should contain arbitrarily long arithmetic progressions.  I will discuss connections between (almost) arithmetic progressions, weak tangents, and Assouad dimension and give a simple proof that sets of positive integers whose reciprocals form a divergent series get arbitrarily close to arbitrarily long arithmetic progressions.\n \nThis is joint work with Han Yu.",
      "video": ""
    },
    "2017-10-10": {
      "name": "Lawrence Lee",
      "title": "Diophantine approximation on manifolds and lower bounds for Hausdorff dimension.",
      "abstract": "Diophantine approximation is a branch of analytic number theory that aims to understand how well real numbers may be approximated by rationals. In this talk I will provide an introduction to Diophantine approximation for those who are unfamiliar with the subject. I will also show how we can establish analogues of classical theorems from the real line on more complicated spaces, such as manifolds.",
      "video": ""
    },
    "2017-10-17": {
      "name": "Han Yu",
      "title": "Fourier series and extra conditions of Duffin-Schaeffer conjecture.",
      "abstract": "Duffin-Schaeffer conjecture concerns approximating real numbers by rationals in lowest form. It is an important topic in Diophantine approximation. Although no solution of this conjecture has been found, there are some partial results proving some weaker forms by strengthening some conditions in the statement of this conjecture. Here, in this talk, we shall see that we can use Fourier analysis to make a tiny step forward and show that the Duffin-Schaeffer conjecture holds under extra logarithmic divergence and  logarithmic Vaaler type upper bound.",
      "video": ""
    },
    "2017-10-24": {
      "name": "Douglas Howroyd",
      "title": "Some dimension results on iterated sumsets.",
      "abstract": "Sumsets have been studied for many years in several different contexts, in particular the dimension of sumsets has often been considered. Thanks to the recent inverse theorem of Hochman we can study the limiting behaviour of the upper box and Assouad dimensions of iterated sumsets, with self-similar sets providing particularly nice examples. This is joint work with Jonathan Fraser and Han Yu.",
      "video": ""
    },
    "2017-10-31": {
      "name": "Mike Todd",
      "title": "Phase transitions and limit laws.",
      "abstract": "I will show how the form of the pressure function for a dynamical system determines its statistical limit laws.  This is particularly interesting when the system has slow mixing properties, or, even more extreme, in the null recurrent case (where the system has an infinite measure).  I will start by introducing these ideas for simple interval maps with nice Gibbs measures and then indicate how this generalises.  This is joint work with Henk Bruin and Dalia Terhesiu.",
      "video": ""
    },
    "2017-11-07": {
      "name": "Andrew Mitchell and Tasos Stylianou",
      "title": "Fractal measures of typical compact metric spaces.",
      "abstract": "J. Rouyer recently proved that a typical compact metric space belonging to the Gromov-Hausdorff space (of all compact metric spaces) has Hausdorff and lower box dimension as small as possible (namely zero), and upper box dimension as large as possible (namely infinity). We study a similar dichotomy for various fractal measures. We also present several applications of our results. For example, as an application, we show that\nthe packing dimension of a typical compact space equals infinity. This talk is based on joint work by S. Jurina, N. Macgregor, A. Mitchell, L. Olsen, and A. Stylianou.",
      "video": ""
    },
    "2017-11-14": {
      "name": "Christian Berg",
      "title": "On moment problems - Historical origins, significance and recent developments.",
      "abstract": "In the talk I will discuss the following subjects:\nIntroduction to the classical moment problem\n(1) The work of Thomas Jan Stieltjes\n(2) The work of Hans Hamburger and Marcel Riesz\n(3) Determinacy versus indeterminacy\n(4) The Nevanlinna parametrization of the indeterminate case\n(5) Order and type of entire functions\n(6) Order of indeterminante moment problems calculated from the recurrence coefficients",
      "video": ""
    },
    "2017-11-21": {
      "name": "Lars Olsen",
      "title": "The Borel Hierarchy, multifractal decomposition sets and Pi<sub>γ</sub><sup>0</sup>-completeness.",
      "abstract": "The Borel hierarchy provides a natural classification of the \"complexity\" of subsets of a metric space. Loosely speaking, for each ordinal gamma, the so-called Π<sub>γ</sub><sup>0</sup>-complete sets are the most complex sets forming the building blocks from which all other Π<sub>γ</sub><sup>0</sup> sets can be build. The talk will analyse sets known as \"multifractal decomposition sets\" from this viewpoint. For example, as an application of our results we show that the classical Eggleston-Besicovitch set is Π<sub>2</sub><sup>0</sup>-complete.",
      "video": ""
    },
    "2017-11-28": {
      "name": "Shayo Olukoya",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2017-12-05": {
      "name": "Collin Bleak",
      "title": "Rational boundary actions of hyperbolic groups.",
      "abstract": "We examine boundaries of hyperbolic spaces, and actions thereon. Two sorts of boundaries enter our discussion: Gromov's visual boundary, and the horofunction boundary determined by Busemann functions. Considering natural actions on metric spaces (e.g., by isometries), we can pass to induced actions on the various notions of boundary. In this regard, there is a well-known theorem of Kapovich and Benakli that a hyperbolic group acts with finite kernel on its visual boundary. In our talk, we analyse this action to discover that the action can actually be modelled by specialised finite state automata called transducers. In consequence, we prove that a very broad class of hyperbolic groups (including the torsion free groups) act faithfully and `rationally' on their boundary, providing a new approach to the study of this vast and interesting class of groups. Joint with Jim Belk and Francesco Matucci.",
      "video": ""
    }
  },
  "Spring 2017": {
    "2017-01-31": {
      "name": "Lars Olsen",
      "title": "Box dimensions of typical compact sets.",
      "abstract": "We study box dimensions of typical (in the sense of Baire)\ncompact sets.",
      "video": ""
    },
    "2017-02-07": {
      "name": "Collin Bleak",
      "title": "On finite generation for groups of homeomorphisms of Cantor spaces.",
      "abstract": "Given a Cantor space C, we define a broad class of subgroups of the group of homeomorphisms of C so that, if a given group G is a subgroup of a finitely generated subgroup H of Homeo(C) and is in our class, we can immediately conclude that G is two-generated. The argument has connections with Higman and Epstein's general arguments toward simplicity for groups of homeomorphisms, and is general enough to immediately prove two-generation, e.g., for many relatives of the Thompson groups, and many other groups as well. Joint with James Hyde.",
      "video": ""
    },
    "2017-02-14": {
      "name": "Mike Todd",
      "title": "Continuity of entropy",
      "abstract": "Given a dynamical system with an invariant measure, the entropy gives a notion of the disorder of the system with respect to that measure. If we now take a convergent sequence of invariant measures, must the entropy of the measures also converge? In general the answer is no, and in fact upper semi-continuity (usc) is the best we can hope for. I'll discuss cases when we do get usc, give examples of how usc can fail, and hopefully give some ideas on how some weaker usc property might still be possible even when the standard usc fails.",
      "video": ""
    },
    "2017-02-21": {
      "name": "Jonathan Fraser",
      "title": "Inhomogeneous attractors: structure and dimension.",
      "abstract": "Inhomogeneous iterated function systems are natural generalisations of the classical iterated function systems, commonly used to generate examples of fractal sets.  The difference being that there is a fixed \"condensation set\" which is dragged into the construction.  Such systems have applications in image compression (the problem of efficiently storing large picture files) in situations where one wants to produce an image with lots of similar objects at different scales, such as a flock of seagulls or a forest.  I will review some structural properties of these attractors and go on to discuss their dimension theory.\n\nSome of this talk will be joint work with Simon Baker and Andras Mathe (both at Warwick).",
      "video": ""
    },
    "2017-02-28": {
      "name": "Sascha Troscheit",
      "title": "Hausdorff measure, gauge functions, and random sets.",
      "abstract": "The Hausdorff measure (and Hausdorff dimension) tells us the exponential scaling behaviour of efficient covers of sets. For some sets the scaling is however not exactly captured by an exponential function and a generalisation of the Hausdorff measure to arbitrary gauge functions can give us more information. In this talk I will introduce the more general Hausdorff measure and apply it to the setting of random sets.",
      "video": ""
    },
    "2017-03-07": {
      "name": "Han Yu",
      "title": "Assouad dimension and Homogeneity of graphs of functions.",
      "abstract": "Assouad dimension and lower dimension can tell us certain local extreme property of fractal sets. A fractal is 'homogeneous' means that it has the same property everywhere in itself, Assouad dimension can tell us if there is somewhere in fractal which is very 'dense' in some sense. In this talk, I will explain some results of Assouad/lower dimension of some certain graphs of functions. Examples includes : Takagi function, graphs of Levy-process (Wiener process).",
      "video": ""
    },
    "2017-03-28": {
      "name": "Kenneth Falconer",
      "title": "Self-affine sets - old and new.",
      "abstract": "I will review the development of the dimension theory of self-affine sets over the past 30 years, including recent work with Tom Kempton which invokes ideas from ergodic theory.",
      "video": ""
    },
    "2017-04-04": {
      "name": "Chandrasekhar Venkataraman",
      "title": "Free boundaries on cell boundaries: asymptotic limits of a model for receptor-ligand dynamics.",
      "abstract": "We consider a coupled bulk-surface system of partial differential equations with nonlinear coupling, that arises as a simplification of a mathematical model for receptor-ligand interactions. Nondimensionalisation of the model leads one to consider a number of biologically relevant asymptotic limits of the model. \n\nIn this talk we develop a mathematical theory for the treatment of the original model together with a rigorous proof of convergence to a number of limiting  bulk-surface free boundary problems in the aforementioned limits. Connections will be made between certain classical free boundary problems and the limit problems. The theoretical results will be supported by computations of the original and reduced problems.  \n\nBased on Joint work with Charles Elliott (Warwick) and Tom Ranner (Leeds)",
      "video": ""
    },
    "2017-04-11": {
      "name": "Nayab Khalid",
      "title": "Dynamical Properties of Connected Rearrangement Groups.",
      "abstract": "I will define connected rearrangement groups and study some of their dynamical properties. In particular, when does the generating set for the group correspond to the basic open sets of the self-similar topological space?",
      "video": ""
    },
    "2017-04-18": {
      "name": "Douglas Howroyd",
      "title": "The upper regularity dimension of measures.",
      "abstract": "The upper regularity dimension of a measure can be thought of as the Assouad dimension of a measure and follows naturally from the measure theoretic definition of Assouad dimension. We will discuss how the upper regularity dimension interacts with other well known definitions of dimension such as the local dimension, providing examples along the way. There is also an interesting relation between this dimension and the doubling property, which we will use to generalise a well known result about tangent measures to weak tangent measures.  This is joint work with Jonathan Fraser.",
      "video": ""
    },
    "2017-04-25": {
      "name": "Abel Farkas",
      "title": "Conditional measure on random sets such as Brownian path and convergence of random measures.",
      "abstract": "For a given measure we construct a random measure on the Brownian path that has expectation the given measure. For the construction we introduce the concept of weak convergence of measures in probability. The machinery can be extended to more general sets than Brownian path.",
      "video": ""
    }
  },
  "Autumn 2016": {
    "2016-09-20": {
      "name": "Collin Bleak",
      "title": "On combinatorial conditions determining isomorphism class for finitely generated subgroups of Homeo_+(I): Advanced Ping-Pong dynamics.",
      "abstract": "﻿We give a finite set of (combinatorial) conditions under which a broad class of finitely generated subgroups of the group of homeomorphisms of the unit interval is determined up to isomorphism.  These conditions are stable under raising the generators to powers, so that the subgroups generated by high-power replacements of the original generators will be isomorphic to the original groups, and these isomorphisms will be witnessed by topological semi-conjugacies.  We then use these conditions to highlight a discussion of the elementary amenable subgroups of the group PL_+(I) of orientation preserving piecewise-linear homeomorphisms of the unit interval, mentioning results which provide new examples of elementary amenable (EA) subgroups of R. Thompson’s group F, which are of EA class of unprecedented complexity.",
      "video": ""
    },
    "2016-09-27": {
      "name": "Douglas Howroyd",
      "title": "Assouad type dimensions of self-affine sponges.",
      "abstract": "﻿We will briefly introduce the Assouad and lower dimensions for those who have never seen them before, providing a brief history of the notions. Then we will discuss self-affine sponges, a natural generalization of Bedford-McMullen carpets. Finally for the second half of the talk we calculate the Assouad dimension of these sponges, work done recently with Fraser.",
      "video": ""
    },
    "2016-10-04": {
      "name": "Kenneth Falconer",
      "title": "Stable, Multistable, and Self-stabilising processes.",
      "abstract": "﻿The talk will be a gentle and well-illustrated introduction to certain random processes that exhibit ‘jumps’. We will introduce stable distributions and then use random point sets in the plane to define \\alpha-stable and multistable processes. The talk will end with a brief outline on recent work on self-stabilising processes.",
      "video": ""
    },
    "2016-10-11": {
      "name": "Mike Todd",
      "title": "Hitting, escaping and mixing.",
      "abstract": "﻿Some recurrence limit laws are more sensitive to slow mixing in a dynamical system than others.  Fixing a hole and considering the exponential rate of escape of mass through it as time goes to infinity will result in a degenerate limit if the mixing is too slow for the hole size (i.e. slow exponential, or even subexponential).  Shrinking the hole linearly with time (Hitting Time Statistics) gives non-degenerate limit laws in all known mixing cases.  I’ll discuss a general framework for these limits and show how they can detect mixing rates.  This is joint work with Henk Bruin and Mark Demers.",
      "video": ""
    },
    "2016-10-18": {
      "name": "Independent Learning Week",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2016-10-25": {
      "name": "Surabhi Desai",
      "title": "Snaking in Systems with Non-Orientable Manifolds.",
      "abstract": "﻿The Swift-Hohenberg equation<br>\n<em>u<sub>t</sub>=-(1+<TD> &part;</TD><sub>x</sub><sup>2</sup>)<sup>2</sup> u - \\(\\mu\\) u  + \\(\\nu\\)  u <sup>2</sup> - u<sup>3</sup>, x ∈ R</em>\n<br>\nis an example of a pattern-forming dynamical system. Previous work, which focused on localised roll patterns in the Swift-Hohenberg equation, involved the study of orientable invariant manifolds. Here we will look at more general systems which exhibit localised rolls with non-orientable invariant manifolds; more specifically, we will investigate the effect this has on the characteristic snaking behaviour of the bifurcation diagrams and on the types of solutions produced.\n<br>\nIn this talk, I will discuss the results obtained when considering the non-orientable case and, more generally, when looking at twisted manifolds. This is joint work with Tarik Aougab, Margaret Beck, Paul Carter, Bj ̈orn Sandstede, Melissa Stadt and Aric Wheeler.",
      "video": ""
    },
    "2016-11-01": {
      "name": "Jonathan Fraser",
      "title": "The Assouad spectrum: scaling and homogeneity in metric spaces (part 1).",
      "abstract": "The Assouad dimension is a familiar notion of dimension which, for a given metric space, returns the minimal exponent <em>\\(\\alpha\\) <TD>&isin;</TD></em> 0 such that for \nany pair of scales <em>0 &lt; r &lt; R</em>, any ball of radius <em>R</em> may be covered by a constant times <em>(R/r)<sup>\\(\\alpha\\)</sup></em> balls of radius <em>r</em>.  We introduce a spectrum \nof dimensions, motivated by the Assouad dimension, designed to get more information about the scaling structure of the space. More precisely, \nto each <em>\\(\\theta\\) <TD>&isin;</TD> (0,1)</em>, we associate the appropriate analogue of the Assouad dimension with the restriction that the two scales <em>r</em> and <em>R </em>\nused in the definition satisfy <em>log R/ log r=\\(\\theta\\)</em>.  We conduct a detailed study of the resulting `dimension spectrum' (as a function of \n<em>\\(\\theta\\)</em>) including its basic analytic and geometric properties as well as the precise calculation of the spectrum for some specific examples.\n<br>\nThis talk is based on joint work with Han Yu and the work can be found at arXiv:1610.02334.",
      "video": ""
    },
    "2016-11-08": {
      "name": "Han Yu",
      "title": "The Assouad spectrum: scaling and homogeneity in metric spaces (part 2).",
      "abstract": "For Assouad spectrum see the introduction in the abstract the week before. This week I will continue talking about some further properties and specific examples of the Assouad spectrum which Dr Jonathan Fraser did not cover last week due to the lacking of time. This talk will contain the bi-Hölder property of Assouad spectrum and a nice application to bi-Hölder unwinding of spirals. Then I will give an example of computing the Assouad spectrum of the famous Mandelbrot perculation.",
      "video": ""
    },
    "2016-11-15": {
      "name": "Bea Adam-Day and Nic Pinzani",
      "title": "On the average box dimension of the graph of a typical continuous function.",
      "abstract": "J. Hyde et. al. proved that, for a typical uniformly continuous function on a bounded subset of the real numbers, the lower box dimension of its graph is as small as possible and the upper box dimension is as large as possible. A natural question to ask now is whether or not it is possible to \"smooth\" out this erratic behaviour by taking averages of the box counting function. It transpires that in fact no such \"smoothing\" is possible using general averaging methods, and indeed the nth order average box dimensions of a typical continuous function are as different as possible. This talk is based on joint work between B. Adam-Day, C. Ashcroft, A.Mitchell, L. Olsen, C. O'Connor, N. Pinzani, A. Rizzoli, and J. Rowe.",
      "video": ""
    },
    "2016-11-22": {
      "name": "Lars Olsen",
      "title": "The Borel hierarchy, multifractal decomposition sets and Pi_{gamma}^0-completeness.",
      "abstract": "The Borel hierarchy provides a natural classification of the \"complexity\" of subsets of a metric space. Loosely speaking, for each ordinal gamma, the so-called Π<sub>γ</sub><sup>0</sup>-complete sets are the most complex sets forming the building blocks from which all other Π<sub>γ</sub><sup>0</sup> sets can be build. The talk will analyse sets known as \"multifractal decomposition sets\" from this viewpoint. For example, as an application of our results we show that the classical Eggleston-Besicovitch set is Π<sub>2</sub><sup>0</sup>-complete.",
      "video": ""
    }
  },
  "Spring 2016": {
    "2016-02-02": {
      "name": "Casey Donoven",
      "title": "Multifractals and Heartbeats",
      "abstract": "Fractal dimensions like the box-counting dimension can be used to study the structure of complex sets and shapes.  Multifractal analysis generalises the concept of fractal dimension and can be applied to many scientific fields. In this talk, I will describe my undergraduate research project on calculating the multifractal spectrum of heartbeat time series.",
      "video": ""
    },
    "2016-03-08": {
      "name": "Bea Adam-Day",
      "title": "\\(Pi_{0}^{1}\\) completeness",
      "abstract": "",
      "video": ""
    },
    "2016-03-29": {
      "name": "Casey Donoven",
      "title": "Invariant relations and edge replacement systems",
      "abstract": "I will compare two types of relations on Cantor space that arise from vaguely self-similar constructions.  Both can be built using graphs that limit on the quotient space.  I will show the exact conditions necessary for a gluing relation resulting from an edge replacement system to be an invariant relation.",
      "video": ""
    },
    "2016-04-05": {
      "name": "Kenneth Falconer",
      "title": "Some problems in plane geometry involving measures and combinatorics",
      "abstract": "I will discuss a number of problems in plane geometry involving ideas from measure theory and combinatorics. This is a version of a talk given to mark the 100th birthday of Paul Erdos.",
      "video": ""
    },
    "2016-04-12": {
      "name": "Nayab Khalid",
      "title": "The Grigorchuk Group - An Introduction",
      "abstract": "I will be introducing Rostislav Grogorchuk's famous (first) Grigorchuk group. I will present some interesting algebraic and topological properties of the group. I hope to make a case for the importance of this group for both algebraists and analysts.",
      "video": ""
    }
  },
  "Autumn 2015": {
    "2015-10-06": {
      "name": "Mike Todd",
      "title": "Continuity of measures",
      "abstract": "Given a convergent family of interval maps and the associated family of SRB/physical measures, one might hope that the measures would converge to the SRB measure of the limit map.  In non-uniformly hyperbolic systems, this naive approach can fail.  I'll give sharp conditions on precisely when this failure occurs for a very general class of maps.  This is part of a wider study of continuity of thermodynamic quantities in collaboration with Neil Dobbs.",
      "video": ""
    },
    "2015-10-20": {
      "name": "Lars Olsen",
      "title": "Asymptotic behaviour of moments and local dimensions of measures",
      "abstract": "The talk will explore the connection between the asymptotic behaviour of the n'th moments of a measure (for large n)\nand fractal properties of the measure (e.g. the local dimensions of the measure and the fractal dimensions of subsets of its support).",
      "video": ""
    },
    "2015-10-27": {
      "name": "Kenneth Falconer",
      "title": "Some geometric properties of Liouville quantum gravity",
      "abstract": "I will attempt to give an introduction to the Liouville quantum gravity measure and indicate some recent work with Xiong Jin relating to its geometrical and analytic properties.",
      "video": ""
    },
    "2015-11-03": {
      "name": "Sascha Troscheit",
      "title": "Box-counting dimension of random self-affine carpets.",
      "abstract": "In this talk we will give a brief history of the study of affine carpets, both deterministic and random, and will introduce random homogeneous and random recursive (1-variable and \\(\\infty\\)-variable, respectively) box-like carpets. We will introduce the notion of 'arrangements of words' and show that the box-counting dimension is almost surely given by the zero of a pressure function involving a modified singular value function.\nIf time allows we will give a few examples that exhibit interesting 'dimension drops' and say a few words about the proof, which involves sub-additive ergodic theory (1-variable case) and supermartingales (\\(\\infty\\)-variable).",
      "video": ""
    },
    "2015-11-10": {
      "name": "Tom Kempton",
      "title": "Projections of self-affine sets.",
      "abstract": "Over the last couple of years there has been great progress in discussing the set of exceptions for Marstrand's projection theorem applied to self-similar sets. In my talk I will discuss how similar progress can be made in the self-affine case.",
      "video": ""
    },
    "2015-11-17": {
      "name": "Casey Donoven",
      "title": "Invariant Quotients of the Cantor Space.",
      "abstract": "I will define what invariant relations on cantor spaces are and motivate them with plenty of examples. I will describe some of their properties and techniques to study them, as well as using them to study self-similar sets.",
      "video": ""
    },
    "2015-11-24": {
      "name": "Collin Bleak",
      "title": "On C* simplicity of group algebras, and normalish subgroups of R. Thompson's groups F and T.",
      "abstract": "A recent paper of E. Breuillard, M. Kalantar, M. Kennedy, and N. Ozawa give new conditions on a group, so that if the group satisfies these conditions, then the (reduced) C* algebra of the group is simple.  Other work of Haagerup and Olesen shows that if either of the (reduced) C* algebras of R. Thompson's groups F or T is simple, then R. Thompson's group F is non-amenable.  We explore some of the conditions of Breuillard et.al. in this context.",
      "video": ""
    },
    "2015-12-01": {
      "name": "Mike Todd",
      "title": "Quantifying inhomogeneity in fractal sets",
      "abstract": "An inhomogeneous fractal set is one which exhibits different scaling behaviour at different points.  Assouad dimension finds the 'most difficult location and scale' at which to cover the set, and the difference between it and box dimension can be thought of as a measure of the inhomogeneity of the set: useful, but rather coarse information.  In this talk I'll present a new detailed quantitative analysis of inhomogeneity via a local version of Assouad dimension, which for standard examples yields a large deviations principle.  This is joint work with Jon Fraser (Manchester).",
      "video": ""
    },
    "2015-12-08": {
      "name": "Vuksan Mijovic",
      "title": "",
      "abstract": "",
      "video": ""
    }
  },
  "Spring 2015": {
    "2015-02-03": {
      "name": "Lars Olsen",
      "title": "Average distances on fractals and average moments",
      "abstract": "We play darts by throwing darts on the Cartor set and ask the following question:\nWhat is the average distance between two randomly thrown darts on the Cantor set?\n\nWe will also consider higher order average moments. In particular, (using techniques from zeta-functions)\nwe will investigate the asymptotic behaviour of higher order average moments of self-similar measures on Cantor sets.\n\nThis is joint work with Allen (York), Edwards (Edinburgh) and Harper (St Andrews).",
      "video": ""
    },
    "2015-02-10": {
      "name": "Collin Bleak",
      "title": "On the derivatives of a class of automorphisms",
      "abstract": "We study the set of automorphisms of the family of Higman groups \\({G_{n,r}}\\).  In particular, we show that any automorphism of a Higman group will have a locally constant Radon-Nikodym derivative, and we apply this knowledge to other descriptions we have about these automorphisms. Joint with Yonah Maissel and Andres Navas.",
      "video": ""
    },
    "2015-02-24": {
      "name": "Casey Donoven",
      "title": "Topological study of fractal structure",
      "abstract": "I will be discussing the paper `Topological spaces admitting a unique fractal structure' by Christoph Bandt and Teklehaimanot Retta.  This paper examines a topological description of self-similar sets with controlable overlaps and in particular shows that some fractals, such as the Siepinski gasket, have a finite group of homeomorphisms.",
      "video": ""
    },
    "2015-03-03": {
      "name": "Sascha Troscheit",
      "title": "Random graph directed systems and box-like carpets",
      "abstract": "In this talk I will briefly describe a construction of box-like self-affine sets, due to Fraser.\nRandomising this construction will serve as motivation to study a different, more abstract, construction of random self-similar graph directed attractors (RGDA). The RGDA considered in this talk are different to the classical concept of random graph directed attractors and we will briefly highlight how to start tackling the problem of proving that the Hausdorff dimension coincides with the box counting dimension for these attractors, independent of overlap. The basic ideas behind the proof are simple, complicated by an intricate use of branching processes, modelling the relevant properties of our attractor by random forests (collection of trees).",
      "video": ""
    },
    "2015-03-10": {
      "name": "Mike Todd",
      "title": "Recurrence in random dynamical systems",
      "abstract": "I'll discuss random dynamical systems (these will be shifts on some alphabet with some random Gibbs measures) and their recurrence properties.  In particular, I'll explain how quenched asymptotic hitting time distributions can be obtained (annealed distributions follow naturally).  In the shift setting, we solve this problem completely.  This is ongoing joint work with Jerome Rousseau (Bahia).",
      "video": ""
    },
    "2015-03-31": {
      "name": "Tom Kempton",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2015-04-07": {
      "name": "Jasmina Angelevska",
      "title": "Weak separation property for self-conformal systems",
      "abstract": "Recently, the article \"On the Assouad dimension of self-similar sets with overlaps\" by J. M. Fraser, A. M. Henderson, E. J. Olson and J. C. Robinson gave an interesting dichotomy. They showed that for nontrivial self-similar subsets of the real line; satisfying the weak separation property (WSP) means the Assouad dimension is same as the Hausdorff dimension, and not satisfying WSP means its Assouad dimension is 1. We would like to generalise this result to self-conformal systems. The project is still work in progress, but some results have already been obtained. I am going to talk about the current results and the ideas we have about continuing the project.\n(Joint work with Sascha Troscheit.)",
      "video": ""
    },
    "2015-04-14": {
      "name": "Yongxin Gui",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2015-04-21": {
      "name": "Vuksan Mijovic",
      "title": "Use of Martingale decomposition to prove statistical properties of dynamical system",
      "abstract": "",
      "video": ""
    }
  },
  "Autumn 2014": {
    "2014-09-23": {
      "name": "Collin Bleak",
      "title": "On infinite descent in groups of PL homeomorphisms",
      "abstract": "We explore the conditions under which a set of PL homeomorphisms of the unit interval will generate groups of high ''complexity'' under different interpretations of complexity.  We show that under easy-to-describe dynamical conditions there are really just three cases of interest (in broad strokes), leading to groups of vastly different complexity. Joint with Tara Brough and Susan Hermiller.",
      "video": ""
    },
    "2014-10-07": {
      "name": "Mike Todd",
      "title": "Dynamical systems with holes: slow mixing cases",
      "abstract": "Fernandez and Demers studied the statistical properties of the Manneville-Pomeau map with the physical measure when a hole is put in the system, overcoming some of the problems Abstract: caused by subexponential mixing. I'll discuss the same setup, but with a class of natural equilibrium states.  We find conditionally invariant measures and give precise information on the transitions between the fast exponentially mixing, the slow exponentially mixing and the subexponentially mixing phases.  This is joint work with Mark Demers.",
      "video": ""
    },
    "2014-10-14": {
      "name": "Sascha Troscheit",
      "title": "Assouad dimension of random fractals",
      "abstract": "In this talk we will give an introduction to Assouad dimension and consider several models of random fractals. We will show that, in general, the Assouad dimension is almost surely as high as possible. This is contrary to other notions of dimension, like Hausdorff, box and packing dimension, which is usually given by some form of `weighted average'. Random sets covered will include self-similar, Bedford-McMullen (self-affine) random constructions and Mandelbrot percolations.\n(Joint work with Jonathan Fraser and Jun Jie Miao)",
      "video": ""
    },
    "2014-10-21": {
      "name": "Tom Kempton",
      "title": "Towards the conjecture 'Box dimension exists for self-affine sets'",
      "abstract": "Despite twenty five years of progress in understanding dimensions of self-affine sets, the question 'does box dimension exist for self-affine sets' remains open. In this talk I will explain how I am attempting to approach the problem.\nWe begin by studying the basic dynamics associated with projections of self-affine sets, and in particular how projections of self-affine sets in different directions are related.\nThis allows us to introduce a related family of trees. We will explain why studying the thermodynamic formalism for these trees ought to resolve the conjecture for some significant special cases.",
      "video": ""
    },
    "2014-10-28": {
      "name": "Gavin Abernethy",
      "title": "Normal numbers",
      "abstract": "I shall be discussing some ideas about normal and non-normal numbers, using results regarding the uniform distribution of sequences as well as from ergodic theory. This talk shall be based on a part of my senior honours project from last year.",
      "video": ""
    },
    "2014-11-04": {
      "name": "Lars Olsen",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2014-11-11": {
      "name": "Kenneth Falconer",
      "title": "Self-similar Fractals: Sections, Projections and Percolation",
      "abstract": "Starting with the basic notions of self-similar sets, the talk will take you on a lavishly illustrated journey visiting a range of geometrical ideas to arrive at the frontiers of research.",
      "video": ""
    },
    "2014-11-18": {
      "name": "Casey Donoven",
      "title": "Fractal Intersections in Cantor Spaces",
      "abstract": "In this talk, I will describe my recent paper with Kenneth Falconer on the intersection of fractal subsets of Cantor sets.  I will provide probabilistic bounds on the upper box-counting and Hausdorff dimensions of the intersection of a fixed fractal subset and the image of another under a random isometry of the Cantor space.",
      "video": ""
    },
    "2014-11-25": {
      "name": "Abel Farkas",
      "title": "Down with separation condition",
      "abstract": "While studying self-similar sets the open set condition or other separation conditions are convenient assumptions. However, proving the results in the general case is usually much more difficult. I will talk about methods that can help to cope with the general case when no separation condition is assumed.",
      "video": ""
    }
  },
  "Spring 2014": {
    "2014-03-21": {
      "name": "Spring Vacation",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2014-02-18": {
      "name": "Mike Todd",
      "title": "Mixing in Dynamical Systems",
      "abstract": "",
      "video": ""
    },
    "2014-02-25": {
      "name": "Vuksan Mijovic",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2014-03-04": {
      "name": "Casey Donoven",
      "title": "Intersections within Cantor Spaces",
      "abstract": "",
      "video": ""
    },
    "2014-03-11": {
      "name": "Jonathan Fraser",
      "title": "The Assouad dimension of self-similar sets with overlaps",
      "abstract": "",
      "video": ""
    },
    "2014-04-01": {
      "name": "Kathryn E Hare",
      "title": "Energy and the Fourier Transform",
      "abstract": "",
      "video": ""
    },
    "2014-04-08": {
      "name": "Kenneth Falconer",
      "title": "Symmetry and Enumeration of Self-similar Fractals",
      "abstract": "",
      "video": ""
    },
    "2014-04-15": {
      "name": "Lars Olsen",
      "title": "Distribution of digits in integers",
      "abstract": "",
      "video": ""
    },
    "2014-04-22": {
      "name": "Collin Bleak",
      "title": "On Kesten-type conditions for computing the ideal structure in C* algebras",
      "abstract": "",
      "video": ""
    }
  },
  "Autumn 2013": {
    "2013-09-24": {
      "name": "Casey Donoven",
      "title": "Groups of homeomorphisms of Cantor sets",
      "abstract": "",
      "video": ""
    },
    "2013-10-08": {
      "name": "Jim Belk",
      "title": "Thompson-Like Groups Acting on Julia Sets",
      "abstract": "",
      "video": ""
    },
    "2013-10-15": {
      "name": "Mike Todd",
      "title": "Teichmüller flow on the space of translation surfaces: towards statistical properties",
      "abstract": "",
      "video": ""
    },
    "2013-10-22": {
      "name": "Kathryn E Hare",
      "title": "Local dimensions of convolutions of measures",
      "abstract": "",
      "video": ""
    },
    "2013-10-29": {
      "name": "Kenneth Falconer",
      "title": "Some problems in combinatorial measure geometry",
      "abstract": "",
      "video": ""
    },
    "2013-11-05": {
      "name": "Sascha Troscheit",
      "title": "Self-similar and self conformal devil's staircases and dimensions of sets of non-differentiability",
      "abstract": "",
      "video": ""
    },
    "2013-11-12": {
      "name": "Jan-Olav Ronning",
      "title": "Square Roots of the Poisson Kernel—Past and Future",
      "abstract": "",
      "video": ""
    },
    "2013-11-19": {
      "name": "Colin Bleak",
      "title": "",
      "abstract": "",
      "video": ""
    },
    "2013-11-26": {
      "name": "Malte Koch",
      "title": "Brownian motion on nested fractals",
      "abstract": "",
      "video": ""
    }
  }
}
