{
  "2025-02-04": {
    "name": "Thierry de Pauw",
    "title": "Density estimate from below in relation to a conjecture of A. Zygmund on Lipschitz differentiation",
    "abstract": "This talk is about a generalisation of the Lebesgue density theorem. With each point x in the plane, we associate a line L(x) containing x and we ask whether, for each Borel-measurable subset A of the plane, the density ratio H<sup>1</sup>(A &cap; B(x,r) &cap; L(x))/2r converges to 1 as r &searr; 0, for a.e. x &isin; A. Here, H<sup>1</sup> is the 1-dimensional Hausdorff measure. The answer depends on the regularity of the mapping L : x &#8614; L(x). If the direction of L is constant, then the answer is positive, according to the Lebesgue density theorem in the real line combined with Fubini's theorem. For some L whose direction is merely continuous, the answer is negative due to the existence of a Nikodym set and, in fact, the above density ratio may vanish for all x &isin; A. I will report on the following progress: if the direction of L is Lipschitz then the superior limit of the above density ratio exceeds 1/4 for a.e. x &isin; A."
  },
  "2025-02-11": {
    "name": "Ana de Orellana",
    "title": "Fourier restriction on fractals",
    "abstract": "We study an extension of the Stein—Tomas restriction theorem using the Fourier spectrum, a family of dimensions that live between the Fourier and Hausdorff dimensions. This leads to an L<sup>p</sup> to L<sup>2</sup> estimate for restriction on multifractals. Joint work with Marc Carnovale and Jonathan Fraser."
  },
  "2025-02-18": {
    "name": "Dmytro Karvatskyi",
    "title": "Topological and fractal properties of self-similar sets with integer similarity dimension",
    "abstract": "We study the topological and fractal properties of self-similar sets on the real line, generated by an IFS with an integer similarity dimension and translations that possess a peculiar combinatorial property. A recent result obtained with O. Makarchuk on the Lebesgue measure of attractors, together with other findings, can help us uncover their topological structure. The most intriguing scenario arises when the attractor has a non-empty interior and a fractal boundary."  
  },
  "2025-02-25": {
    "name": "Pieter Allaart",
    "title": "Random subsets of self-similar sets",
    "abstract": "We consider random subsets of self-similar sets generated by a branching random walk with exponentially decreasing steps, or equivalently, via random labelings of the edges of a full infinite M-ary tree. These random subsets can be viewed as statistically self-similar sets with extreme overlaps, hence their almost-sure box-counting and Hausdorff dimensions coincide. We show that the computation of this dimension breaks into three essentially different cases, depending on the parameters of the model. In one case, the random subset has the same dimension as the self-similar set it is part of, although it is almost surely a proper subset. We give precise formulas for the dimension in the other two cases. This is joint work with Lauritz Streck."
  },
  "2025-03-11": {
    "name": "Antti Kaemaki",
    "title": "Hausdorff dimension of self-affine sponges with random contractions",
    "abstract": "We compute the almost sure Hausdorff dimension of random self-affine sponges in R^d without imposing any separation conditions. In this context, randomness arises from the matrices in the defining semigroup, which are random yet the corresponding affine maps share a fixed point. This setup reveals a novel phenomenon: the almost sure Hausdorff dimension---even in the separated self-similar case---depends on the specific way randomness is introduced into the matrices. This talk presents ongoing research conducted with Balázs Bárány and Michal Rams."
  },
  "2025-03-18": {
    "name": "Lijian Yang",
    "title": "TBD",
    "abstract": ""
  },
  "2025-03-25": {
    "name": "Natalia Jurga",
    "title": "TBD",
    "abstract": ""
  },
  "2025-04-01": {
    "name": "Tianyi Feng",
    "title": "TBD",
    "abstract": ""
  },
  "2025-04-15": {
    "name": "Kenneth Falconer",
    "title": "TBD",
    "abstract": ""
  },
  "2025-04-22": {
    "name": "Yunlong Xu",
    "title": "TBD",
    "abstract": ""
  },
  "2025-04-29": {
    "name": "Collin Bleak",
    "title": "TBD",
    "abstract": ""
  }
}
