{
  "2025-09-10": {
    "name": "Simon Baker",
    "title": "Expansions in non-integer bases",
    "abstract": "A seemingly innocuous generalisation of binary expansions involves replacing 2 with a parameter q satisfying 1 < q < 2. This change leads to substantially different behaviour. For instance, a Lebesgue typical point has uncountably many expansions in base q. Moreover, for any integer k, there exists q and x such that x has precisely k expansions in base q. This is contrary to the case of binary expansions where every point has a unique expansion apart from a countable set of exceptions with precisely two. In this talk I will discuss some recent results on those bases that admit points with precisely k expansions. This talk will be based upon joint work with George Bender."
  },
  "2025-09-23": {
    "name": "Selim Ghazouani",
    "title": "Speculations and problems about parabolic dynamical systems",
    "abstract": "I will make an attempt at defining what a parabolic dynamical system is and will try to explain why, despite their relative unimportance in the modern theory of dynamical systems, they provide one with very entertaining questions to think about. Roughly speaking, a parabolic system it is a dynamical system for which nearby points drift apart at polynomial speed. An enticing feature of such systems is that they are all very different from one another, unlike hyperbolic systems which tend to enjoy fairly universal dynamical properties. The talk will build upon extensive numerical experiments, to illustrate known theorems as well as to invite open problems/conjectures."
  },
  "2025-09-30": {
    "name": "Jonathan Fraser",
    "title": "Dimension interpolation: the story so far",
    "abstract": "Dimension interpolation is a general approach to understanding and characterising fractal objects.  The idea is to carefully define 'dimension functions' which live in-between familiar notions of fractal dimension, such as Hausdorff dimension, box dimension etc, with the hope of gaining more information than the individual notions provide in isolation.  I will motivate and survey this area by discussing several examples and applications."  
  },
  "2025-10-07": {
    "name": "Stephen Cantrell",
    "title": "",
    "abstract": ""
  },
  "2025-10-14": {
    "name": "Mike Todd",
    "title": "",
    "abstract": ""
  },
  "2025-10-28": {
    "name": "Ana de Orellana",
    "title": "",
    "abstract": ""
  },
  "2025-11-04": {
    "name": "Saeed Shaabanian",
    "title": "",
    "abstract": ""
  },
  "2025-11-11": {
    "name": "Lauritz Streck",
    "title": "",
    "abstract": ""
  },
  "2025-11-18": {
    "name": "Firdavs Rakhmonov",
    "title": "",
    "abstract": ""
  },
  "2025-11-25": {
    "name": "Roope Anttila",
    "title": "",
    "abstract": ""
  },
  "2025-12-02": {
    "name": "Natalia Jurga",
    "title": "",
    "abstract": ""
  }
}
