{
  "2026-01-13": {
    "name": "Henna Koivusalo",
    "title": "On cut and project sets and substitutions",
    "abstract": "Cut and project sets are obtained by taking an irrational slice through a lattice and projecting it to a lower dimensional subspace. This usually results in a set which has no translational period, even though it retains a lot of the regularity of the lattice. As such, cut and project sets are one of the archetypical examples of point sets featuring aperiodic order. The other canonical method for generating aperiodic order is via substitutions; point sets generated from an inflation-redecoration process. Many classical examples of aperiodic order, e.g. the famous Penrose tiling, have a description from both methods. It is hence fundamental to the theory of aperiodically ordered point sets to answer the question: What property characterises those cut and project sets which have a substitution description. In this talk I will give an overview of the definition and basic properties of cut and project sets, discuss classical examples of aperiodic order, define the notion of `pattern with a substitution rule', and finally come to a new result of mine, answering the question above. This work is joint with Jamie Walton (Nottingham) and Edmund Harriss (Arkansas)."
  },
  "2026-02-03": {
    "name": "Steve Cantrell",
    "title": "Regularity of the pressure for quasi-morphisms on subshifts",
    "abstract": "Classical results from symbolic dynamics and thermodynamic formalism tell us about the dynamical/ergodic properties of Hölder functions on subshifts of finite type. In this talk we’ll discuss how to extend some of these results to a general class of functions called quasi-morphisms. We’ll also discuss some applications of these results to geometric problems."
  },
  "2026-02-10": {
    "name": "Lars Olsen",
    "title": "The Baire Hierarchy, multifractal decomposition sets and Π<sub>γ</sub><sup>0</sup>-completeness",
      "abstract": "This talk will discuss the position of the so-called \"multifractal decomposition sets\" in the Baire Hierarchy. In particular, we will prove that \"multifractal decomposition sets\" are the building blocks from which all other &Pi;<sub>&gamma;</sub><sup>0</sup>-sets can be constructed; more, precisely, \"multifractal decomposition sets\" are &Pi;<sub>&gamma;</sub><sup>0</sup>-complete.\n\nAs an application we find the position of the classical Eggleston-Besicovitch set in the Baire Hierarchy.",
      "video": ""
    },
    "2026-02-17": {
    "name": "Haocong Song",
    "title": "Finiteness of Isometry Groups of Self-Similar Sets in R^3",
    "abstract": "This talk will give a brief introduction to the symmetry problem for self-similar sets. We resolve the problem in R^3, and I will share some of the key ideas involved in both the R^2 and R^3 cases. I will also outline the difficulties that arise when attempting to extend these methods to higher-dimensional spaces."
  },
  "2026-02-24T14:00:00Z": {
    "name": "Kevin Hughes (Edinburgh Napier University)",
    "exception": "2pm, Lecture Theatre D",
    "title": "Estimates for the plunge region of limiting operators",
    "abstract": "A version of the uncertainty principle tells us that a nonzero function on Euclidean space cannot be compactly supported while its Fourier transform is compactly supported. This does not align with our perception of communications where signals are often treated as being localized in both physical space and frequency space. Trying to understand this, Landau, Pollack, Slepian and Widom studied the asymptotic eigenvalue distribution of time-frequency limiting operators. Their operators have eigenvalues in the interval (0,1) with the properties that 1) there are a predictable number of eigenvalues close to 1, 2) almost all eigenvalues decay quickly to 0 and 3) there is a 'plunge region' between the first two phenomena where the eigenvalues 'plunge' down towards 0. I will survey some recent work with and by A. Israel (UT Austin) and A. Mayeli (CUNY) on estimating the number of eigenvalues in the plunge region for analogous limiting operators in higher dimensions. See arXiv:1502.04404, arXiv:2301.09616, arXiv:2301.11685, arXiv:2403.13092, and arXiv:2601.21224."
  },
  "2026-02-24T15:00:00Z": {
    "name": "Lijiang Yang",
    "title": "Fourier Dimension and Kakeya-Type Sets in the Plane",
    "abstract": "The Fourier dimension of a Borel set is defined through the decay rate of the Fourier transforms of measures supported on the set. In this talk, I will discuss several basic properties of the Fourier dimension and compute it for a number of examples. In particular, I will show that every Kakeya set in the plane has Fourier dimension 2. We will also study the range of possible Fourier dimensions for certain restricted Kakeya-type sets. More precisely, suppose the direction set has Hausdorff dimension at least t, and in each such direction we consider a subset of a unit line segment whose Fourier dimension is at least s. I will show that the Fourier dimension of such a set is bounded below by 2st/(s+2t) and may be as small as min{s,2t}. Joint work with Jon."
  },
  "2026-03-10": {
    "name": "Yuyang Liu",
    "title": "TBC",
    "abstract": "TBC"
  },
  "2026-03-17": {
    "name": "Natalia Jurga",
    "title": "TBC",
    "abstract": "TBC"
  },
  "2026-03-24": {
    "name": "Fabian Despinoy",
    "title": "TBC",
    "abstract": "TBC"
  },
  "2026-03-31T14:00:00Z": {
    "name": "José Alves (Porto University)",
    "exception": "2pm, Lecture Theatre D",
    "title": "TBC",
    "abstract": "TBC"
  },
  "2026-03-31T15:00:00Z": {
    "name": "Yunlong Xu",
    "title": "TBC",
    "abstract": "TBC"
  },
  "2026-04-07": {
    "name": "Tianyi Feng",
    "title": "TBC",
    "abstract": "TBC"
  },
  "2026-04-14": {
    "name": "Luke Derry",
    "title": "TBC",
    "abstract": "TBC"
  },
   "2026-04-21": {
    "name": "Sascha Troscheit (Uppsala University)",
    "title": "TBC",
    "abstract": "TBC"
   },
  "2026-04-28": {
    "name": "Kenneth Falconer",
    "title": "TBC",
    "abstract": "TBC"
  }
}
