{
  "2023-09-19": {
    "name": "Alex Rutar",
    "title": "Multifractal analysis of planar self-affine measures via convex optimization",
    "abstract": "A key problem in the multifractal analysis of measures is to understand the structure of the set of points with non-typical local scaling behaviour. The multifractal formalism is a heuristic principle relating the structure of such sets with a type of large deviations bound associated with statistical averages related to the measure. In this talk, I will present an interpretation of the multifractal formalism for self-similar measures from the perspective of convex optimization. I will then discuss how this interpretation extends to planar self-affine measures. Naturally, there are many additional complications and exotic new phenomena are possible. The new results are based on joint work in progress with Thomas Jordan (Bristol) and Istv치n Kolossv치ry."
  },
  "2023-09-26": {
    "name": "Istv치n Kolossv치ry",
    "title": "Some variants of the variational principle",
    "abstract": "A common theme in my recent projects has been to solve optimisation problems usually involving entropies and Lyapunov exponents. In each case the goal is to show a kind of variational principle. I will survey these problems over probability vectors from easier to more complex and show how they come up in the study of <var>L<sup>q</sup></var> dimensions, multifractal analysis and the Assouad spectrum."
  },
  "2023-10-03": {
    "name": "Mike Todd",
    "title": "Effective estimates on closeness of measures",
    "abstract": "Given two invariant measures for a dynamical system, we can see how close they are to each other by integrating them both against some observable function and taking the difference.  In this talk I'll explain how ideas from thermodynamic formalism can give sharp estimates for these differences in terms of a fractional power of a pressure function.  The applications are to nonuniformly hyperbolic systems and show that the required fractional power depends on the speed of mixing of the system.  This is joint work with G Iommi and D Terhesiu."
  },
  "2023-10-10": {
    "name": "Shuqin Zhang",
    "title": "Multifractal tube measures of in-homogeneous self-similar measures",
    "abstract": "Minkowski volume refers to the study of the volumes of r-neighbourhoods of sets. lt is natural to extend the concept of Minkowski volume to multifractals, which we refer to as multifractal tube measures. In this talk, I will talk about the asymptotic behaviour of the q-th normalized total multifractal tube measures of in-homogeneous self-similar measures satisfying the In-homogeneous Open Set Condition. I will also talk about the convergence of the q-th normalized multifractal tube measures of in-homogeneous self-similar measures. These results are based on joint work in progress with Lars Olsen."
  },
  "2023-10-24": {
    "name": "Argyrios Christodoulou",
    "title": "Uniform hyperbolicity of matrix semigroups",
    "abstract": "A semigroup of 2x2 matrices is called uniformly hyperbolic if norms of products in the semigroup grow exponentially with respect to product length. It can be shown that uniform hyperbolicity is  equivalent to the semigroup inducing a strongly contracting iterated function system on projective space. In this talk we give an overview of the geometry surrounding these objects, their interaction with other matrix semigroups and a formula for the Hausdorff dimension of their attractor."
  },
  "2023-10-31": {
    "name": "Lars Olsen",
    "title": "TBA",
    "abstract": "TBA"
  },
  "2023-11-7": {
    "name": "Boyuan Zhao",
    "title": "TBA",
    "abstract": "TBA"
  },
  "2023-11-14": {
    "name": "Mark Holland",
    "title": "TBA",
    "abstract": "TBA"
  },
  "2023-11-21": {
    "name": "Dmytro Karvatsky",
    "title": "TBA",
    "abstract": "TBA"
  }
}
