{
  "2022-09-20": {
    "name": "Jonathan Fraser",
    "title": "Introducing the Fourier dimension spectrum",
    "abstract": "The Fourier dimension of a measure captures the rate at which its Fourier transform decays at infinity.  The Hausdorff dimension of a set, on the other hand, describes how the set fills up space on small scales by studying the cost of efficient covers.  Despite how different they appear at first sight, these notions are intimately connected.  Following the philosophy of 'dimension interpolation', I will introduce and discuss the 'Fourier dimension spectrum', which interpolates between the two notions. Time permitting, we will encounter applications to distance sets and sumsets."
  },
  "2022-09-27": {
      "name": "Mike Todd",
      "title": "Quantifying mixing and recurrence",
      "abstract": "I’ll give an introduction to (exponential) decay of correlations in dynamical systems, how this can be proved and the relevant constants involved.  Moving to symbolic dynamics gives a clearer perspective on the constants involved here: I’ll discuss where they come from and how they might be improved."
  },
  "2022-10-04": {
      "name": "István Kolossváry",
      "title": "Multifractal analysis of self-affine measures on a simple Branski carpet",
      "abstract": "Baranski carpets exhibit interesting phenomena not witnessed by systems satisfying some sort of coordinate ordering property. We demonstrate that this is also true for multifractal analysis by looking at self-affine measures on a simple Baranski carpet. Namely, the multifractal formalism fails (i.e. the Legendre transform of the <var>L<sup>q</sup></var> spectrum is not equal to the multifractal spectrum), even though the carpet has no overlaps and its Hausdorff and box dimensions are equal. The spectrum even has a jump discontinuity in case of the natural measure."
  },
  "2022-10-11": {
      "name": "Aleksi Pyörälä",
      "title": "Normal numbers in self-conformal sets",
      "abstract": "During recent years, the prevalence of normal numbers in natural subsets of the reals has been an active research topic in fractal geometry. The general idea is that in the absence of any special arithmetic structure, almost all numbers in a given set should be normal, in every base. In our recent joint work with Balázs Bárány, Antti Käenmäki and Meng Wu we verify this for all self-conformal sets on the line. The result is a corollary of a uniform scaling property of self-conformal measures: roughly speaking, a measure is said to be uniformly scaling if the sequence of successive magnifications of the measure equidistributes, at almost every point, for a common distribution supported on the space of measures. Dynamical properties of these distributions often give information on the geometry of the uniformly scaling measure."
  },
  "2022-11-01": {
      "name": "Amlan Banaji",
      "title": "Metric spaces where geodesics are never unique",
      "abstract": "Geodesics are important objects in geometry, representing (in some sense) the shortest paths through a space. We introduce a class of metric spaces, called multigeodesic spaces, where between any two distinct points there exist multiple distinct minimising geodesics. We will prove a simple characterisation of multigeodesic normed spaces and deduce that <var>L<sup>1</sup></var> spaces provide an example. In general metric spaces, however, examples such as Laakso spaces show that a wider variety of behaviour is possible."
  },
  "2022-11-08": {
      "name": "Kenneth Falconer",
      "title": "",
      "abstract": ""
  },
  "2022-11-15": {
      "name": "Natalia Jurga",
      "title": "",
      "abstract": ""
  },
  "2022-11-22": {
      "name": "Alex Rutar",
      "title": "",
      "abstract": ""
  },
  "2022-11-29": {
      "name": "Lars Olsen",
      "title": "",
      "abstract": ""
  }
}
