{
  "2023-01-24": {
    "name": "Jonathan Fraser",
    "title": "More on the Fourier spectrum...",
    "abstract": "In my most recent analysis seminar I introduced the Fourier spectrum, which is a continuously parameterised family of dimensions living in-between the Fourier and Hausdorff dimensions. In this talk I will speak about applications of this concept in a variety of areas."
  },
  "2023-01-31": {
    "name": "Collin Bleak",
    "title": "Embeddings into Finitely Presented Simple Groups",
    "abstract": "In this talk, we describe a process whereby we can embed any hyperbolic group into a finitely presented infinite simple group.  This gives a proof of what is, in some sense, the “typical” case of the Boone-Higman Conjecture of 1973 (that a finitely generated group G has a solvable word problem if and only if G can be embedded into a finitely presented simple group).<br><br>The talk will proceed in three roughly independent parts: A short history of the Boone-Higman Conjecture,  a discussion of Hyperbolic groups and an embedding of these into the Rational group of Grigorchuk, Nekrashevych, and Suschanskii, and finally, a discussion of why the topological full group over this rational group is finitely presented and simple, or, at least provides a route to a further embedding in a group that is finitely presented and simple.<br><br>Joint with James Belk, Francesco Matucci, and Matthew Zaremsky."
  },
  "2023-02-07": {
    "name": "Mike Whittaker",
    "title": "Poincaré duality of self-similar actions",
    "abstract": "A self-similar group (G,X) consists of a group G acting faithfully on a homogeneous rooted tree such that the action satisfies a self-similarity condition. In this talk I will outline a generalisation of Nekrashevych's theorem that K-theoretic invariants of associated C*-algebras satisfy Poincaré duality. This result ties together ideas from operator algebras, dynamical systems and geometric group theory in a truly beautiful way. I'll use this as an excuse to explain some ideas and underlying themes behind studying C*-algebras, and no knowledge of operator algebras is required. This is joint work with Nathan Brownlowe, Alcides Buss, Daniel Gonçalves, Jeremy Hume, and Aidan Sims."
  },
  "2023-02-14": {
    "name": "Mike Todd",
    "title": "Thermodynamic formalism for flows",
    "abstract": "Given a dynamical system, Multifractal analysis can be used to study certain dynamically defined level sets. In this talk I will describe some work in progress which takes a more general thermodynamic formalism perspective on the level sets, in the context of flows."
  },
  "2023-03-07": {
    "name": "István Kolossvary",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-03-14": {
    "name": "Natalia Jurga",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-03-21": {
    "name": "Amlan Banaji",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-03-28": {
    "name": "Lars Olsen",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-04-04": {
    "name": "Boyuan Zhao",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-04-11": {
    "name": "Kenneth Falconer",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-04-18": {
    "name": "Spyridon Dimoudis",
    "title": "TBD",
    "abstract": "TBD"
  },
  "2023-04-25": {
    "name": "Alex Rutar",
    "title": "TBD",
    "abstract": "TBD"
  }
}
